smartlake26-rgb/smartlake/firmware/aqua_monitor_esp32.ino
// ================================================================
//  AQUA MONITOR v12.0 - ESP32 DevKit USB-C + SIM800L
//  Baliq ko'llari uchun universal avtomatik aeratsiya tizimi
//  + GSM (SMS/qo'ng'iroq) + INTERNET (WiFi BIRINCHI, SIM/GPRS ZAXIRA)
//
//  [v12.0] WiFi QO'SHILDI (v11.0 ustiga) — UNIVERSAL ULANISH:
//    - Telemetriya endi AVVAL WiFi orqali yuboriladi (ESP32 HTTPClient,
//      tez va AT'siz). WiFi ulanmagan/uzilgan bo'lsa -> avtomatik SIM800L
//      (GPRS) ga o'tadi. Ikkalasi ham yo'q bo'lsa o'tkazib yuboradi
//      (soatlik tarix baribir NVS'da). JSON formati o'zgarmaydi.
//    - WiFi SOZLASH: bo'sh ekranda [111T] -> WiFiManager portali ochiladi.
//      Qurilma vaqtincha "AquaMonitor-WiFi" nuqtasi bo'ladi; fermer
//      telefonidan ulanib, o'z WiFi'sini tanlab parol kiritadi -> saqlanadi
//      va keyin avtomatik ulanaveradi. Portal NON-BLOCKING (3 daq timeout):
//      sozlash davomida ham rele/sensor/alarm ishlab turaveradi.
//    - WiFi 2.4 GHz; pinlarga tegmaydi (ichki radio). SIM bilan birga ishlaydi.
//
//  [v11.0] Internet (GPRS->ThingsBoard HTTP) + ikki tomonlama SMS + chip-ID:
//    - QURILMA ID: ESP32 chip ID dan (masalan "AQ7F8A2C"), o'zgarmas.
//    - Telemetriya JSON: {id, do, ph, t, aer}.
//    - Kiruvchi SMS buyruqlari: AERATOR ON/AUTO, MINDO/FARQ/KRITIK <n>, HOLAT.
//
//  UMUMIY KODLAR (bo'sh ekranda):
//    [000T] -> Zavod reseti (NVS to'liq tozalanadi)
//    [111T] -> WiFi sozlash portali
//
//  [v10.x] GSM (SIM800L) — SMS/qo'ng'iroq, 000T, barqarorlik:
//    - SIM800L modul UART1 (GPIO 18 TX, 35 RX, 23 RST) orqali
//    - To'liq NON-BLOCKING AT holat mashinasi (loop'ni bloklamaydi,
//      WDT/sensor/relay/keypad ishiga umuman halaqit qilmaydi)
//    - Kritik DO (## ikki marta bosilganda) — qo'ng'iroq chegarasi
//    - Telefon raqami (R tugmasi, KISLOROD rejimida) — 9 raqam → +998
//    - ALARM: DO < kritik bo'lsa → avval SMS, keyin qo'ng'iroq.
//      Ko'tarmasa har 10 daqiqada qayta, soatiga maksimum 3 marta.
//      Fermer ko'tarsa (javob bersa) → o'sha epizodda to'xtaydi.
//      DO kritik+0.5 ga tiklansa → "normaga qaytdi" SMS va alarm o'chadi.
//    - Soatlik holat SMS'i (har soat :58 da, KISLOROD rejimida)
//    - DO sensor o'lsa → "sensor nosoz" SMS (bir marta)
//    - 1-soatlik boshlang'ich rejimda ham alarm to'liq ishlaydi
//    - LCD da signal ko'rsatkichi (CSQ): soat 2 katak chapga,
//      14-15 katakda antenna + 0-4 panjara (eski telefondagidek)
//    - Uzun T (bo'sh holatda 3s ushlab tursa) → test SMS + test qo'ng'iroq
//
//  [v9.1] Tuzatilgan xatolar (v9.0 dan):
//    - BUG #1 KRITIK: tsikilniYangilash() ichidagi if/else bloklari
//      {} qavslar bilan to'g'rilandi (logik xato - noto'g'ri ishlaydi edi)
//    - BUG #2 KRITIK: WDT initsializatsiyasi esp_task_wdt_reconfigure()
//      o'rniga Arduino core 2.x/3.x bilan mos keluvchi usulga o'tkazildi
//    - BUG #3: Sensor qayta urinishda doXato/phXato false qilinmagan edi,
//      endi sensor tikilganda xato bayroqlari ham tozalanadi
//    - BUG #4: doTarixiKorsat() ichida delay(2000)+delay(500) orasida
//      esp_task_wdt_reset() qo'shildi (WDT trip xavfi bor edi)
//    - BUG #5: vaqtJadvaliniKorsat() ichida delay lararo WDT reset qo'shildi
//    - BUG #6: lTugmasiBosildi() - LCD clear() chaqirilmasdan ustiga yozilardi,
//      endi to'liq tozalanadi
//    - BUG #7: sensorOqishKerakmi() - REJIM_VAQT da ham loop() ichida
//      readSensorDataSmart() chaqiriladi (pH uchun), ammo DO sensor
//      VAQT rejimida o'qilmaydi - bu to'g'ri holat
//    - YAXSHILANISH: sensor retry oralig'i 1 soat o'rniga 5 daqiqaga
//      qisqartirildi (ishlab chiqarishda real sensor ulanib-uzilishi uchun)
//
//  BOSHQARUV REJIMLARI:
//    [L]    → Rejim tanlash (L bir marta: Kislorod, L ikki marta: Vaqt)
//
//  KISLOROD REJIMI:
//    [#]    → Min DO kiriting (mg/L, butun son, masalan 5)
//    [*]    → Farq kiriting  (mg/L, butun son, masalan 2)
//             Mantiq: DO < min → rele ON; DO >= min+farq → rele OFF
//    [T]    → Saqlash
//    [E]    → DO tarixi ko'rsatish
//
//  VAQT REJIMI:
//    [R]    → Yangi vaqt oralig'i kiritish (format: SSDDBBOO)
//             Misol: 18402200 → 18:40 dan 22:00 gacha
//    [T]    → Saqlash (5 tagacha oralig' saqlanadi)
//    [E]    → Saqlangan barcha vaqt oralig'larini ko'rsatish
//    [D]    → Oxirgi kiritilgan oralig'ni o'chirish
//
//  UMUMIY:
//    [000T] → Barcha ma'lumotlarni tozalab standartga qaytarish.
//             Istalgan paytda (menyuga kirmasdan) bo'sh ekranda 0 0 0
//             bosib, so'ng T bosiladi. NVS to'liq tozalanadi: DO tarixi,
//             telefon raqami, vaqt jadvali, min/farq/kritik DO — hammasi.
//    [F]    → DO sensori kalibrlash
//    [B]    → Harorat kalibrlash
//    [U]    → RTC soatni sozlash (format: OOKKSSDD)
//             Misol: 06150930 → 15-iyun 09:30
//    [R]    → Kiritishni bekor qilish (vaqt rejimidan tashqarida)
//
//  GSM / SIM800L BOSHQARUV (KISLOROD rejimida):
//    [#]    → 1 marta: Min DO (aerator yonish chegarasi)
//    [##]   → 2 marta tez: Kritik DO (qo'ng'iroq chegarasi)
//    [R]    → Telefon raqami kiritish (9 raqam, +998 avtomatik qo'shiladi)
//             Misol: 972014669 → +998972014669
//    [T]    → (bo'sh holatda 3 soniya ushlab tursa) TEST SMS + qo'ng'iroq
//
//  XOTIRAGA YOZISH:
//    Har soat 58-59 daqiqada, sensor faol bo'lganda
//    Kalit: (oy*31+kun)*24+soat — oydan-oyga adashmasligi kafolatlangan
//    Maksimal yozuvlar: 48 ta (2 kun, ring buffer)
//
//  TSIKL MANTIG'I (boshlang'ich 1 soat tugagach):
//    [ 0-19] daqiqa  → SENSOR UXLAYDI  (20 daqiqa)
//    [20-29] daqiqa  → SENSOR ISHLAYDI (10 daqiqa)
//    [30-49] daqiqa  → SENSOR UXLAYDI  (20 daqiqa)
//    [50-59] daqiqa  → SENSOR ISHLAYDI (10 daqiqa)
//
//  PIN TAQISH (ESP32 DevKit USB-C 38-pin):
//    KEYPAD ROW : GPIO 12,14,27,26,25
//    KEYPAD COL : GPIO 33,32,13,19
//    LCD  SDA   : GPIO 21
//    LCD  SCL   : GPIO 22
//    RTC  SDA   : GPIO 21  (LCD bilan umumiy I2C)
//    RTC  SCL   : GPIO 22
//    RS485 RX   : GPIO 16
//    RS485 TX   : GPIO 17
//    RS485 DE/RE: GPIO 4
//    RELE       : GPIO 5
//    SIM800L TX : GPIO 18  (ESP32 -> SIM RXD, rezistor bo'luvchi orqali)
//    SIM800L RX : GPIO 35  (SIM TXD -> ESP32, faqat-kirish pin)
//    SIM800L RST: GPIO 23  (modul osilib qolsa qayta tiklash)
//    SIM800L VCC: 5V manba -> 1N4007 diod (~4.3V) -> SIM VCC
//                 (1000uF kondensator VCC-GND ga yaqin joylashtiriladi)
// ================================================================

#include <Wire.h>
#include <Keypad.h>
#include <LiquidCrystal_I2C.h>
#include <ModbusMaster.h>
#include <RTClib.h>
#include <Preferences.h>
#include <esp_task_wdt.h>
#include <ctype.h>
#include <WiFi.h>
#include <HTTPClient.h>
#include <WiFiClientSecure.h>   // Firebase HTTPS uchun
#include <WiFiManager.h>   // tzapu/WiFiManager (Library Manager'dan o'rnating)

// ================================================================
//  PINLAR
// ================================================================
static const uint8_t RELE_PIN = 5;
static const uint8_t RS485_DE = 4;
#define MODBUS_RX 16
#define MODBUS_TX 17

// SIM800L (UART1)
#define SIM_TX_PIN 18    // ESP32 TX -> SIM RXD (bo'luvchi orqali)
#define SIM_RX_PIN 35    // ESP32 RX <- SIM TXD (faqat-kirish)
#define SIM_RST_PIN 23   // SIM RST (manfiy impuls bilan reset)

// ================================================================
//  INTERNET SOZLAMALARI (WiFi -> Firebase RTDB, SIM zaxira)
//  -------------------------------------------------------------
//  Telemetriya AVVAL WiFi orqali Firebase Realtime Database'ga
//  HTTPS PUT bilan yuboriladi (tez va ishonchli). WiFi yo'q bo'lsa
//  va FB_SIM_RELAY sozlangan bo'lsa, SIM800L (GPRS->HTTP relay)
//  orqali zaxira yo'l ishlatiladi.
//
//  FB_HOST bo'sh bo'lsa -> internet butunlay o'chiq, qurilma faqat
//  lokal + SMS rejimida ishlaydi (xavfsiz standart). O'rnatishda
//  to'g'ri APN va Firebase RTDB host/kalitini kiriting.
// ================================================================
static const char*         GPRS_APN     = "internet";  // operator APN (o'zgartiring)

// --- FIREBASE Realtime Database (HTTPS REST) ---
// FB_HOST: RTDB host, SXEMASIZ ("https://" YOZMANG). Misol:
//   "smartlake-1234-default-rtdb.firebaseio.com"  yoki regional:
//   "smartlake-1234-default-rtdb.europe-west1.firebasedatabase.app"
// FB_HOST bo'sh bo'lsa -> internet butunlay o'chiq (faqat lokal + SMS).
static const char*         FB_HOST      = "";           // RTDB host (sxemasiz)
static const char*         FB_AUTH      = "";           // RTDB maxfiy kaliti yoki bo'sh (qoidalar ochiq bo'lsa)
// SIM800L Firebase HTTPS'ni ishonchli qo'llab-quvvatlamaydi. SIM orqali ham
// yubormoqchi bo'lsangiz, oddiy HTTP->Firebase relay manzilini kiriting
// (masalan Cloud Function). Bo'sh bo'lsa SIM telemetriyasi o'chiq.
static const char*         FB_SIM_RELAY = "";           // "http://relay.example.com/telemetry"
static const unsigned long TELEMETRY_MS = 300000UL;     // 5 daqiqada bir marta yuborish

// ================================================================
//  AERATSIYA REJIMI — #define bilan
// ================================================================
#define REJIM_KISLOROD  0
#define REJIM_VAQT      1

// ================================================================
//  TSIKL HOLATI — #define bilan
//  RTC daqiqasiga ko'ra aniqlanadi:
//    [ 0-19] → TSIKL_UXLASH
//    [20-29] → TSIKL_ISHLASH
//    [30-49] → TSIKL_UXLASH
//    [50-59] → TSIKL_ISHLASH  (soat oxiri — xotiraga yozish oynasi)
// ================================================================
#define TSIKL_ISHLASH  0
#define TSIKL_UXLASH   1

// ================================================================
//  HARDWARE
// ================================================================
LiquidCrystal_I2C lcd(0x27, 16, 2);
RTC_DS3231        rtc;
Preferences       prefs;
HardwareSerial    modbusSerial(2);
ModbusMaster      node;
HardwareSerial    simSerial(1);   // SIM800L uchun alohida apparat UART

void preTransmission()  { digitalWrite(RS485_DE, HIGH); }
void postTransmission() { digitalWrite(RS485_DE, LOW);  }

// ================================================================
//  KEYPAD
// ================================================================
static const byte ROWS = 5;
static const byte COLS = 4;
char keys[ROWS][COLS] = {
  {'*', '#', 'B', 'F'},
  {'U', '3', '2', '1'},
  {'D', '6', '5', '4'},
  {'E', '9', '8', '7'},
  {'T', 'R', '0', 'L'}
};
