smartlake26-rgb/smartlake/firmware/aqua_monitor_esp32.ino
byte rowPins[ROWS] = {12, 14, 27, 26, 25};
byte colPins[COLS] = {33, 32, 13, 19};
Keypad keypad = Keypad(makeKeymap(keys), rowPins, colPins, ROWS, COLS);

// ================================================================
//  GLOBAL O'ZGARUVCHILAR
// ================================================================

// Aeratsiya rejimi
static uint8_t aeratsiyaRejimi = REJIM_KISLOROD;

// Joriy tsikl holati (RTC asosida yangilanadi)
static uint8_t tsikilRejim = TSIKL_ISHLASH;

// Boshlang'ich 1 soat rejimi
static const unsigned long BOSHLANGICH_MUDDAT_MS = 3600000UL;
static bool          boshlangichRejimda = true;
static unsigned long boshlangichBosh    = 0;

// Xotira yozuv kaliti — 0xFFFF = hali yozilmagan
static uint16_t oxirgiYozuvKaliti = 0xFFFF;

// Sensor o'zgaruvchilari (×10 format)
static int16_t do_x10 = 0;
static int16_t ph_x10 = 0;
static int16_t t_x10  = 0;

static bool    doXato             = false;
static bool    phXato             = false;
static bool    doAktivmi          = true;
static bool    phAktivmi          = true;
static uint8_t qaysiSensorNavbati = 1;

// Taymerlar
static unsigned long lastDoCheckTime      = 0;
static unsigned long lastPhCheckTime      = 0;
static unsigned long lastMeasureTime      = 0;
static unsigned long lastEkranVaqti       = 0;
static unsigned long lastUxlashEkranVaqti = 0;
static unsigned long lastTsikilTekshir    = 0;

// Kislorod rejimi sozlamalari
static int16_t minDo_x10  = 50;   // standart: 5.0 mg/L
static int16_t farqDo_x10 = 20;   // standart: 2.0 mg/L

// Vaqt rejimi sozlamalari
static const uint8_t MAX_VAQT_ORALIQ = 5;

struct VaqtOraliq {
  uint8_t boshH;
  uint8_t boshM;
  uint8_t oxirH;
  uint8_t oxirM;
  bool    faol;
};

static VaqtOraliq vaqtJadvali[MAX_VAQT_ORALIQ];
static uint8_t    vaqtOraliqSoni = 0;

// Rele
static bool          releHolati        = false;
static unsigned long releOzgarishVaqti = 0;

// Xotira (ring buffer)
static const uint8_t MAX_RECORDS      = 48;
static uint8_t       eeprom_head_cache  = 0;
static uint8_t       eeprom_count_cache = 0;

// Kiritish holati
static char    inputText[10]      = "";   // 9 raqamli telefon + null uchun
static uint8_t inputLen           = 0;
static char    joriyRejimKiritish = ' ';
static bool    isCalibrating      = false;
static int8_t  kiritilganHarorat  = -1;

static uint8_t       lTugmaHolati = 0;
static unsigned long lTugmaVaqti  = 0;

static unsigned long nonBlockStart = 0;
static uint16_t      nonBlockMs    = 0;
static bool          nonBlockAktiv = false;

// ================================================================
//  GSM / SIM800L O'ZGARUVCHILARI
// ================================================================

// Kritik DO (qo'ng'iroq chegarasi), ×10 format. 0 = o'rnatilmagan
static int16_t kritikDo_x10 = 0;

// Re-arm chegarasi: DO kritik+0.5 ga chiqsa alarm o'chadi (miltillashga qarshi)
static const int16_t ALARM_REARM_OFFSET_X10 = 5;   // 0.5 mg/L

// Telefon raqami: "+998" + 9 raqam = 13 belgi + null
static char telRaqam[16] = "";   // bo'sh = raqam yo'q

// --- SIM holat mashinasi ---
#define SIM_KUT        0   // yoqilgandan keyin modul tayyor bo'lishini kutish
#define SIM_INIT       1   // AT, ATE0, CMGF=1, CLIP=1
#define SIM_TARMOQ     2   // CREG tekshirish (ro'yxatdan o'tish)
#define SIM_TAYYOR     3   // bo'sh, ishga tayyor
#define SIM_SMS_CMGS   4   // AT+CMGS="..." -> ">" kutiladi
#define SIM_SMS_TANA   5   // matn + Ctrl-Z -> +CMGS/OK kutiladi
#define SIM_QONG_TER   6   // ATD... -> OK kutiladi
#define SIM_QONG_KUZAT 7   // CLCC bilan javob/tugashni kuzatish
#define SIM_QONG_UZISH 8   // ATH yuborish
#define SIM_NET_BEARER 9   // GPRS bearer + HTTP sozlash (SAPBR/HTTPINIT/HTTPPARA)
#define SIM_HTTP_TELEM 10  // HTTP telemetriya: DOWNLOAD -> data -> HTTPACTION

static uint8_t       simHolat        = SIM_KUT;
static unsigned long simHolatVaqti   = 0;     // joriy holatga kirgan vaqt
static unsigned long simBoshVaqti    = 0;     // yoqilgan vaqt (KUT uchun)
static bool          simTayyormi     = false; // tarmoqqa ulangan
static uint8_t       simInitBosqich  = 0;     // INIT ichki bosqichi
static uint8_t       simUrinish      = 0;     // qayta urinishlar (init/tarmoq)

// SIM javob buferi
static char    simBuf[160];
static uint16_t simBufLen = 0;

// CSQ (signal) — 0..31, 99=noma'lum; LCD ko'rsatkichi uchun
static uint8_t  simSignal     = 99;
static unsigned long simCsqVaqti = 0;

// --- SMS navbati (ring buffer) ---
#define SMS_MAX_UZUN  120
#define SMS_NAVBAT    4
static char    smsNavbat[SMS_NAVBAT][SMS_MAX_UZUN];
static uint8_t smsBosh = 0;
static uint8_t smsSon  = 0;

// --- Qo'ng'iroq so'rovi ---
static bool          qongPending     = false;  // qo'ng'iroq qilish kerak
static bool          qongTest        = false;  // joriy qo'ng'iroq TEST uchunmi
static unsigned long qongKuzatBosh   = 0;      // jiringlash boshlanishi
static bool          qongJavobBerildi = false; // CLCC: javob aniqlandi

// --- Alarm epizodi mantig'i ---
static bool          alarmFaol       = false;  // DO kritikdan past (faol epizod)
static bool          alarmTasdiq     = false;  // fermer javob berdi (epizodda)
static uint8_t       alarmQongSoni   = 0;      // shu soatdagi qo'ng'iroqlar (max 3)
static uint8_t       alarmQongSoat   = 0xFF;   // hisob qaysi soatga tegishli
static unsigned long alarmOxirgiQong = 0;      // oxirgi qo'ng'iroq vaqti
static const uint8_t ALARM_MAX_QONG_SOAT = 3;
static const unsigned long ALARM_QONG_ORALIQ_MS = 600000UL;  // 10 daqiqa

// --- Sensor nosozligi xabari ---
static bool          sensorNosozXabar = false; // "sensor nosoz" SMS yuborilganmi

// --- Soatlik SMS ---
static uint16_t      oxirgiSmsKaliti = 0xFFFF; // soatlik SMS takror yubormaslik

// --- Uzun T (test) aniqlash ---
static bool          tBosildi   = false;
static unsigned long tBoshVaqti = 0;
static const unsigned long T_UZUN_MS = 3000UL;

// ================================================================
//  QURILMA ID + INTERNET (GPRS/HTTP) O'ZGARUVCHILARI
// ================================================================
// Qurilma ID — ESP32 chip ID dan olinadi, o'zgarmas (masalan "AQ7F8A2C")
static char          deviceId[16] = "";

// Internet holati
static bool          internetYoqilgan = false;   // FB_HOST bo'sh bo'lmasa true
static unsigned long lastTelemetriya  = 0;        // oxirgi yuborish vaqti
static uint8_t       httpBosqich      = 0;        // burst ichki bosqichi
static char          telemetriyaBuf[128] = "";    // yuboriladigan JSON

// Qo'lda (SMS bilan) aeratorni majburan yoqish bayrog'i
static bool          qolReleYoq = false;

// --- WiFi (WiFiManager) holati ---
WiFiManager          wm;
static bool          wifiPortalAktiv = false;   // sozlash portali ochiqmi
static unsigned long wifiPortalBosh  = 0;        // portal ochilgan vaqt
static bool          simTelemSora    = false;    // SIM orqali telemetriya so'rovi (loop -> SIM)

// ================================================================
//  KONSTANTALAR
// ================================================================
static const unsigned long SOAT_INTERVALI     = 3600000UL;
// [v9.1]: Sensor retry 5 daqiqaga qisqartirildi (ishlab chiqarishda tez tiklanish)
static const unsigned long SENSOR_RETRY_MS    =  300000UL;  // 5 daqiqa
static const unsigned long SENSOR_INTERVAL_MS =     400UL;
static const unsigned long EKRAN_INTERVAL_MS  =     400UL;
static const unsigned long RELE_DEBOUNCE_MS   =    5000UL;
static const unsigned long TSIKL_TEKSHIR_MS   =    5000UL;
static const unsigned long L_TIMEOUT          =    3000UL;

// ================================================================
//  FUNKSIYA PROTOTIPLARI
// ================================================================
void ekranniYangilash();
void xotiragaYozish(const DateTime& now);
void tsikilniYangilash();
void boshqarishRele();
void readSensorDataSmart();
bool sensorOqishKerakmi();
void nonBlockXabar(const char* xabar, uint16_t ms);
void showClock();
void uxlashEkrani();
void doTarixiKorsat();
void vaqtJadvaliniKorsat();
void standartgaQaytarish();
void runKislorodKalibrlash();
void runHaroratKalibrlash();
void klaviaturaBoshqar(char key);
void saqlashTugmasi();
void lTugmasiBosildi();
void prefsTekshir();
void prefsYozHead(uint8_t val);
void prefsYozCount(uint8_t val);
void prefsYozuvSaqla(uint8_t idx, uint8_t h, uint8_t m,
                     uint8_t kun, uint8_t oy, uint8_t doB);
void prefsYozuvOqish(uint8_t idx, uint8_t &h, uint8_t &m,
                     uint8_t &kun, uint8_t &oy, uint8_t &doB);
void vaqtJadvaliniSaqla();
void vaqtJadvaliniYukla();
void datchikBoshlanishTekshir();
bool vaqtRejimiReleHolati();
void nonBlockTekshir();
uint8_t daqiqadanTsikilAniqla(uint8_t daqiqa);
uint16_t yozuvKalitHisopla(uint8_t oy, uint8_t kun, uint8_t soat);
uint8_t oyningKunlari(uint8_t oy, uint16_t yil);

// --- GSM / SIM800L ---
void simBoshlash();
void simYangilash();              // loop'da chaqiriladi, non-blocking
void simResetModul();
void simBuferGa();                // UART dan o'qib simBuf ga yig'ish
bool simJavobBor(const char* token);
void simYuborln(const char* s);
bool smsNavbatgaQosh(const char* matn);
void qongiroqSorov(bool test);
void alarmniTekshir();            // DO ni kritik bilan solishtirish
void alarmQaytaQong();            // 10 daq qayta qo'ng'iroq (soatiga max 3)
void sensorNosozTekshir();        // DO sensor o'lsa SMS
void soatlikSmsTekshir(const DateTime& now);
void signalniLCDgaChiz();
void simSignalCharlarYarat();
void telRaqamKiritishOch();

