smartlake26-rgb/smartlake/firmware/aqua_monitor_esp32.ino
// --- Qurilma ID / Internet (GPRS+HTTP) / SMS buyruq ---
void deviceIdYarat();
void telemetriyaTayyorla();
void smsBuyruqniQolla(const char* matn);
bool wifiBilanYubor();
void wifiPortalBoshla();

// ================================================================
//  YORDAMCHI: millis() overflow-safe taqqoslash
// ================================================================
inline bool taymerOtdimi(unsigned long t0, unsigned long dt) {
  return (millis() - t0) >= dt;
}

// ================================================================
//  LCD YORDAMCHI
// ================================================================
void lcdIkkiRaqam(uint8_t n) {
  lcd.print((char)('0' + n / 10));
  lcd.print((char)('0' + n % 10));
}

void lcdX10(int16_t val) {
  if (val < 0) { lcd.print('-'); val = -val; }
  lcd.print(val / 10);
  lcd.print('.');
  lcd.print(val % 10);
}

// ================================================================
//  NON-BLOCKING XABAR
// ================================================================
void nonBlockXabar(const char* xabar, uint16_t ms) {
  lcd.setCursor(0, 1);
  lcd.print("                ");
  lcd.setCursor(0, 1);
  lcd.print(xabar);
  nonBlockStart = millis();
  nonBlockMs    = ms;
  nonBlockAktiv = true;
}

void nonBlockTekshir() {
  if (!nonBlockAktiv) return;
  if (!taymerOtdimi(nonBlockStart, nonBlockMs)) return;
  nonBlockAktiv = false;
  lcd.setCursor(0, 1);
  lcd.print("                ");
  inputLen = 0;
  inputText[0] = '\0';
  joriyRejimKiritish = ' ';
  ekranniYangilash();
}

// ================================================================
//  PREFERENCES (NVS)
// ================================================================
void prefsYozHead(uint8_t val) {
  if (val != eeprom_head_cache) {
    prefs.putUChar("head", val);
    eeprom_head_cache = val;
  }
}

void prefsYozCount(uint8_t val) {
  if (val != eeprom_count_cache) {
    prefs.putUChar("count", val);
    eeprom_count_cache = val;
  }
}

void prefsYozuvSaqla(uint8_t idx, uint8_t h, uint8_t m,
                     uint8_t kun, uint8_t oy, uint8_t doB) {
  char kalit[4];
  kalit[0] = 'r';
  kalit[1] = '0' + (idx / 10);
  kalit[2] = '0' + (idx % 10);
  kalit[3] = '\0';
  uint8_t buf[5] = {h, m, kun, oy, doB};
  prefs.putBytes(kalit, buf, 5);
}

void prefsYozuvOqish(uint8_t idx, uint8_t &h, uint8_t &m,
                     uint8_t &kun, uint8_t &oy, uint8_t &doB) {
  char kalit[4];
  kalit[0] = 'r';
  kalit[1] = '0' + (idx / 10);
  kalit[2] = '0' + (idx % 10);
  kalit[3] = '\0';
  uint8_t buf[5] = {0, 0, 0, 0, 0};
  prefs.getBytes(kalit, buf, 5);
  h = buf[0]; m = buf[1]; kun = buf[2]; oy = buf[3]; doB = buf[4];
}

// ================================================================
//  VAQT JADVALINI NVS GA SAQLASH / YUKLASH
// ================================================================
void vaqtJadvaliniSaqla() {
  prefs.putUChar("vj_son", vaqtOraliqSoni);
  for (uint8_t i = 0; i < MAX_VAQT_ORALIQ; i++) {
    char kalit[4];
    kalit[0] = 'v'; kalit[1] = 'j';
    kalit[2] = '0' + i; kalit[3] = '\0';
    uint8_t buf[5] = {
      vaqtJadvali[i].boshH,
      vaqtJadvali[i].boshM,
      vaqtJadvali[i].oxirH,
      vaqtJadvali[i].oxirM,
      vaqtJadvali[i].faol ? 1u : 0u
    };
    prefs.putBytes(kalit, buf, 5);
  }
}

void vaqtJadvaliniYukla() {
  vaqtOraliqSoni = prefs.getUChar("vj_son", 0);
  if (vaqtOraliqSoni > MAX_VAQT_ORALIQ) vaqtOraliqSoni = 0;
  for (uint8_t i = 0; i < MAX_VAQT_ORALIQ; i++) {
    char kalit[4];
    kalit[0] = 'v'; kalit[1] = 'j';
    kalit[2] = '0' + i; kalit[3] = '\0';
    uint8_t buf[5] = {0, 0, 0, 0, 0};
    prefs.getBytes(kalit, buf, 5);
    vaqtJadvali[i].boshH = buf[0];
    vaqtJadvali[i].boshM = buf[1];
    vaqtJadvali[i].oxirH = buf[2];
    vaqtJadvali[i].oxirM = buf[3];
    vaqtJadvali[i].faol  = (buf[4] == 1);
  }
}

// ================================================================
//  YOZUV KALITINI HISOBLASH
//  Kalit = (oy * 31 + kun) * 24 + soat
// ================================================================
uint16_t yozuvKalitHisopla(uint8_t oy, uint8_t kun, uint8_t soat) {
  return (uint16_t)((uint16_t)(oy * 31u + kun) * 24u + soat);
}

// ================================================================
//  OY VALIDATSIYASI
// ================================================================
uint8_t oyningKunlari(uint8_t oy, uint16_t yil) {
  bool kabisa = ((yil % 4 == 0 && yil % 100 != 0) || (yil % 400 == 0));
  switch (oy) {
    case 1: case 3: case 5: case 7:
    case 8: case 10: case 12: return 31;
    case 4: case 6: case 9:  case 11: return 30;
    case 2: return kabisa ? 29 : 28;
    default: return 0;
  }
}

// ================================================================
//  SOZLAMALARNI STANDARTGA QAYTARISH
// ================================================================
void standartgaQaytarish() {
  // ----------------------------------------------------------
  //  TO'LIQ ZAVOD RESETI:
  //  Butun NVS tozalanadi (DO tarixi, telefon raqami, vaqt jadvali,
  //  barcha sozlamalar), so'ng standart qiymatlar qayta yoziladi va
  //  butun runtime holat (GSM/alarm/SMS navbati) nolga qaytariladi.
  // ----------------------------------------------------------
  prefs.clear();                       // <-- hamma kalitlar o'chadi

  // --- Standart qiymatlarni qayta yozish ---
  prefs.putUChar("head",   0);
  prefs.putUChar("count",  0);
  prefs.putShort("minDo",  50);
  prefs.putShort("farqDo", 20);
  prefs.putUChar("rejim",  (uint8_t)REJIM_KISLOROD);
  prefs.putShort("kritikDo", 0);
  prefs.putString("tel", "");
  prefs.putUChar("ver", 0xB0);

  // --- RAM nusxalarini standartga ---
  eeprom_head_cache  = 0;
  eeprom_count_cache = 0;
  minDo_x10    = 50;
  farqDo_x10   = 20;
  kritikDo_x10 = 0;
  telRaqam[0]  = '\0';
  aeratsiyaRejimi = REJIM_KISLOROD;

  vaqtOraliqSoni = 0;
  for (uint8_t i = 0; i < MAX_VAQT_ORALIQ; i++) {
    vaqtJadvali[i] = {0, 0, 0, 0, false};
  }
  vaqtJadvaliniSaqla();                // vj_son=0 va vj0..vj4 ni nol holatda yozadi

