smartlake26-rgb/smartlake/firmware/aqua_monitor_esp32.ino
  // --- Tsikl / boshlang'ich holat ---
  oxirgiYozuvKaliti  = 0xFFFF;
  oxirgiSmsKaliti    = 0xFFFF;
  boshlangichRejimda = true;
  boshlangichBosh    = millis();
  tsikilRejim        = TSIKL_ISHLASH;
  qaysiSensorNavbati = 1;

  // --- GSM / alarm runtime holatini tozalash (raqam o'chgach SMS/qo'ng'iroq chiqmasin) ---
  smsBosh = 0; smsSon = 0;
  qongPending = false; qongTest = false;
  alarmFaol = false; alarmTasdiq = false;
  alarmQongSoni = 0; alarmQongSoat = 0xFF;
  alarmOxirgiQong = millis();
  sensorNosozXabar = false;
  qolReleYoq = false;

  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("Standartga      ");
  lcd.setCursor(0, 1); lcd.print("qaytarildi!     ");
  esp_task_wdt_reset();
  delay(1500);
  esp_task_wdt_reset();
  lcd.clear();
  esp_task_wdt_reset();
}

// ================================================================
//  NVS BOSHLASH
// ================================================================
void prefsTekshir() {
  prefs.begin("aqua", false);
  uint8_t ver = prefs.getUChar("ver", 0xFF);

  // v10.0 — NVS versiyasi 0xB0 (GSM qo'shildi)
  if (ver != 0xB0) {
    // Eski 0xAF sozlamalarini saqlab qolib, faqat yangi kalitlarni qo'shamiz
    bool eski_af = (ver == 0xAF);

    if (!eski_af) {
      // Butunlay yangi yoki notanish versiya: hammasini tozalash
      prefs.clear();
      prefs.putUChar("head",   0);
      prefs.putUChar("count",  0);
      prefs.putShort("minDo",  50);
      prefs.putShort("farqDo", 20);
      prefs.putUChar("rejim",  0);
      prefs.putUChar("vj_son", 0);
      eeprom_head_cache  = 0;
      eeprom_count_cache = 0;
      vaqtOraliqSoni     = 0;
      for (uint8_t i = 0; i < MAX_VAQT_ORALIQ; i++) {
        vaqtJadvali[i] = {0, 0, 0, 0, false};
      }
    } else {
      // 0xAF -> 0xB0 migratsiya: mavjud sozlamalar saqlanadi
      eeprom_head_cache  = prefs.getUChar("head",  0);
      eeprom_count_cache = prefs.getUChar("count", 0);
      if (eeprom_head_cache  >= MAX_RECORDS) eeprom_head_cache  = 0;
      if (eeprom_count_cache >  MAX_RECORDS) eeprom_count_cache = 0;
      minDo_x10       = prefs.getShort("minDo",  50);
      farqDo_x10      = prefs.getShort("farqDo", 20);
      aeratsiyaRejimi = prefs.getUChar("rejim", 0);
      if (aeratsiyaRejimi != REJIM_KISLOROD &&
          aeratsiyaRejimi != REJIM_VAQT)
        aeratsiyaRejimi = REJIM_KISLOROD;
      vaqtJadvaliniYukla();
    }

    // Yangi GSM kalitlari (standart qiymatlar)
    prefs.putShort("kritikDo", 0);
    prefs.putString("tel", "");
    kritikDo_x10 = 0;
    telRaqam[0]  = '\0';

    prefs.putUChar("ver", 0xB0);
  } else {
    eeprom_head_cache  = prefs.getUChar("head",  0);
    eeprom_count_cache = prefs.getUChar("count", 0);
    if (eeprom_head_cache  >= MAX_RECORDS) eeprom_head_cache  = 0;
    if (eeprom_count_cache >  MAX_RECORDS) eeprom_count_cache = 0;
    minDo_x10       = prefs.getShort("minDo",  50);
    farqDo_x10      = prefs.getShort("farqDo", 20);
    aeratsiyaRejimi = prefs.getUChar("rejim", 0);
    if (aeratsiyaRejimi != REJIM_KISLOROD &&
        aeratsiyaRejimi != REJIM_VAQT)
      aeratsiyaRejimi = REJIM_KISLOROD;
    vaqtJadvaliniYukla();

    // GSM sozlamalari
    kritikDo_x10 = prefs.getShort("kritikDo", 0);
    telRaqam[0] = '\0';
    prefs.getString("tel", telRaqam, sizeof(telRaqam));   // heap-siz (String'siz)
  }
}

// ================================================================
//  DATCHIK BOSHLANISH TEKSHIRUVI
// ================================================================
void datchikBoshlanishTekshir() {
  lcd.setCursor(0, 0);
  lcd.print("Datchiklar...   ");

  uint8_t xato = 0;
  for (uint8_t i = 0; i < 3; i++) {
    esp_task_wdt_reset();
    node.begin(1, modbusSerial);
    if (node.readHoldingRegisters(0x0000, 4) != node.ku8MBSuccess) xato++;
    delay(150);
    esp_task_wdt_reset();
  }
  if (xato >= 3) { doAktivmi = false; doXato = true; }

  xato = 0;
  for (uint8_t i = 0; i < 3; i++) {
    esp_task_wdt_reset();
    node.begin(2, modbusSerial);
    if (node.readHoldingRegisters(0x0000, 2) != node.ku8MBSuccess) xato++;
    delay(150);
    esp_task_wdt_reset();
  }
  if (xato >= 3) { phAktivmi = false; phXato = true; }

  node.begin(1, modbusSerial);
}

// ================================================================
//  TSIKL HOLATI — RTC daqiqasiga ko'ra aniqlanadi
//  Qaytish qiymati: TSIKL_ISHLASH yoki TSIKL_UXLASH
// ================================================================
uint8_t daqiqadanTsikilAniqla(uint8_t daqiqa) {
  if (daqiqa < 20) return TSIKL_UXLASH;
  if (daqiqa < 30) return TSIKL_ISHLASH;
  if (daqiqa < 50) return TSIKL_UXLASH;
  return TSIKL_ISHLASH;  // 50-59: soat oxiri
}

// ================================================================
//  SENSOR O'QISH KERAKMI?
// ================================================================
bool sensorOqishKerakmi() {
  if (aeratsiyaRejimi != REJIM_KISLOROD) return false;
  if (boshlangichRejimda) return true;       // 1 soat davomida doim o'qiydi
  return (tsikilRejim == TSIKL_ISHLASH);     // tsikl ISHLASH da o'qiydi
}

// ================================================================
//  [v9.1] TSIKL VA XOTIRA YANGILASH (5 soniyada bir marta)
//
//  BUG #1 TUZATILDI: if/else bloklari {} bilan to'g'rilandi.
//  Avvalgi kodda:
//    if (tsikilRejim == TSIKL_ISHLASH)
//      lcd.setCursor(0, 1);           ← faqat bu if ga kirgan
//      lcd.print("Sensor ishlaydi "); ← bu HAR DOIM bajarilgan!
//    else
//      lcd.setCursor(0, 1);           ← bu else ga kirgan
//      lcd.print("Sensor uxlaydi  "); ← bu HAR DOIM bajarilgan!
// ================================================================
void tsikilniYangilash() {
  if (aeratsiyaRejimi != REJIM_KISLOROD) return;
  if (!taymerOtdimi(lastTsikilTekshir, TSIKL_TEKSHIR_MS)) return;
  lastTsikilTekshir = millis();

  esp_task_wdt_reset();
  DateTime now        = rtc.now();
  uint8_t  joriyDaq   = now.minute();
  uint8_t  joriySoat  = now.hour();
  uint8_t  joriyKun   = now.day();
  uint8_t  joriyOy    = now.month();
  esp_task_wdt_reset();

  // ----------------------------------------------------------
  //  1. Boshlang'ich 1 soat rejimi tekshiruvi
  // ----------------------------------------------------------
  if (boshlangichRejimda) {
    if (taymerOtdimi(boshlangichBosh, BOSHLANGICH_MUDDAT_MS)) {
      boshlangichRejimda = false;
      tsikilRejim = daqiqadanTsikilAniqla(joriyDaq);

      lcd.clear();
      lcd.setCursor(0, 0);
      lcd.print("Tsikl rejimi    ");
      // [BUG #1 TUZATILDI]: Har bir if/else {} bilan o'ralgan
      if (tsikilRejim == TSIKL_ISHLASH) {
        lcd.setCursor(0, 1);
        lcd.print("Sensor ishlaydi ");
      } else {
        lcd.setCursor(0, 1);
        lcd.print("Sensor uxlaydi  ");
      }
      esp_task_wdt_reset();
      delay(1200);
      esp_task_wdt_reset();
      lcd.clear();
      esp_task_wdt_reset();
    } else {
      // Boshlang'ich davrda tsikl = ISHLASH (doim sensor faol)
      tsikilRejim = TSIKL_ISHLASH;
    }
  }

  // ----------------------------------------------------------
  //  2. Oddiy tsikl: RTC daqiqasiga ko'ra holat yangilash
  // ----------------------------------------------------------
  if (!boshlangichRejimda) {
    uint8_t yangiHolat = daqiqadanTsikilAniqla(joriyDaq);

    if (yangiHolat != tsikilRejim) {
      tsikilRejim        = yangiHolat;
      qaysiSensorNavbati = 1;

      lcd.clear();
      if (tsikilRejim == TSIKL_ISHLASH) {
        lcd.setCursor(0, 0);
        lcd.print("Sensor yondi    ");
        lcd.setCursor(0, 1);
        if (joriyDaq >= 50) {
          lcd.print("Soat oxiri :58da");
        } else {
          lcd.print("Daqiqa 20-30    ");
        }
      } else {
        // [BUG #1 TUZATILDI]: qolDaq hisoblash to'g'ri qavslangan
        uint8_t qolDaq = (joriyDaq < 20) ? (20 - joriyDaq) : (50 - joriyDaq);
        lcd.setCursor(0, 0);
        lcd.print("Sensor uxlaydi  ");
        lcd.setCursor(0, 1);
        lcd.print("Qoldi: ~");
        lcd.print(qolDaq);
        lcd.print(" daq  ");
      }
      esp_task_wdt_reset();
      delay(1200);
      esp_task_wdt_reset();
      lcd.clear();
      esp_task_wdt_reset();
    }
  }

  // ----------------------------------------------------------
  //  3. Xotiraga yozish: har soat 58-59 daqiqada
  //     Sensor faol bo'lishi shart (tsikl ISHLASH yoki boshlang'ich davr)
  // ----------------------------------------------------------
  bool sensorFaolMi = boshlangichRejimda || (tsikilRejim == TSIKL_ISHLASH);

  if (sensorFaolMi && (joriyDaq == 58 || joriyDaq == 59)) {
    uint16_t joriyKalit = yozuvKalitHisopla(joriyOy, joriyKun, joriySoat);
    if (joriyKalit != oxirgiYozuvKaliti) {
      xotiragaYozish(now);
      oxirgiYozuvKaliti = joriyKalit;
      soatlikSmsTekshir(now);   // soatlik holat SMS (KISLOROD, raqam bor bo'lsa)
    }
  }
}

// ================================================================
//  VAQT REJIMI — RELE BOSHQARUVI
// ================================================================
bool vaqtRejimiReleHolati() {
  if (vaqtOraliqSoni == 0) return false;

  DateTime now = rtc.now();
  uint16_t joriyDaq = (uint16_t)now.hour() * 60u + now.minute();

  for (uint8_t i = 0; i < MAX_VAQT_ORALIQ; i++) {
    if (!vaqtJadvali[i].faol) continue;
    uint16_t boshDaq = (uint16_t)vaqtJadvali[i].boshH * 60u + vaqtJadvali[i].boshM;
    uint16_t oxirDaq = (uint16_t)vaqtJadvali[i].oxirH * 60u + vaqtJadvali[i].oxirM;

    if (boshDaq < oxirDaq) {
      if (joriyDaq >= boshDaq && joriyDaq < oxirDaq) return true;
    } else if (boshDaq > oxirDaq) {
      // Gechayu-kunduz kesib o'tuvchi oraliq (masalan 22:00-06:00)
      if (joriyDaq >= boshDaq || joriyDaq < oxirDaq) return true;
    }
  }
  return false;
}

// ================================================================
//  EKRAN YANGILASH
// ================================================================
void ekranniYangilash() {
  if (wifiPortalAktiv) return;
  if (joriyRejimKiritish != ' ') return;
  // Uxlash rejimida uxlash ekrani ishlaydi
  if (!boshlangichRejimda &&
      aeratsiyaRejimi == REJIM_KISLOROD &&
      tsikilRejim == TSIKL_UXLASH) return;

  lcd.setCursor(0, 0);
  if (aeratsiyaRejimi == REJIM_KISLOROD) {
    if (!doXato && doAktivmi) {
      lcd.print("DO:");  lcdX10(do_x10);
      lcd.print(" T:");  lcdX10(t_x10);
      lcd.print((char)223); lcd.print('C');
    } else {
      lcd.print("DO:?    T:?     ");
    }
  } else {
    lcd.print("VAQT ");
    lcd.print(releHolati ? "ON  " : "OFF ");
    lcd.print('[');
    lcd.print(vaqtOraliqSoni);
    lcd.print("/5]  ");
  }

