smartlake26-rgb/smartlake/firmware/aqua_monitor_esp32.ino
  lcd.setCursor(0, 1);
  if (aeratsiyaRejimi == REJIM_KISLOROD) {
    if (!phXato && phAktivmi) {
      lcd.print("Ph:"); lcdX10(ph_x10);
      lcd.print(' ');
    } else {
      lcd.print("Ph:?   ");
    }
  } else {
    lcd.print("               ");
  }
}

// ================================================================
//  SOAT (2-qator o'ng)
// ================================================================
void showClock() {
  if (wifiPortalAktiv) return;
  if (joriyRejimKiritish != ' ') return;
  if (!boshlangichRejimda &&
      aeratsiyaRejimi == REJIM_KISLOROD &&
      tsikilRejim == TSIKL_UXLASH) return;
  DateTime now = rtc.now();
  lcd.setCursor(9, 1);          // 11->9: 14-15 katak antenna uchun bo'shaydi
  lcdIkkiRaqam(now.hour());
  lcd.print(':');
  lcdIkkiRaqam(now.minute());
}

// ================================================================
//  UXLASH EKRANI — keyingi o'qish oynasini ko'rsatadi
// ================================================================
void uxlashEkrani() {
  if (wifiPortalAktiv) return;
  if (aeratsiyaRejimi != REJIM_KISLOROD) return;
  if (boshlangichRejimda) return;
  if (tsikilRejim != TSIKL_UXLASH) return;
  if (!taymerOtdimi(lastUxlashEkranVaqti, 5000UL)) return;
  lastUxlashEkranVaqti = millis();

  esp_task_wdt_reset();
  DateTime now      = rtc.now();
  uint8_t  joriyDaq = now.minute();
  esp_task_wdt_reset();

  uint8_t keyingiOyna;
  uint8_t qolganDaq;
  if (joriyDaq < 20) {
    keyingiOyna = 20;
    qolganDaq   = 20 - joriyDaq;
  } else {
    keyingiOyna = 50;
    qolganDaq   = 50 - joriyDaq;
  }

  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("Sensor uxlaydi  ");
  lcd.setCursor(0, 1); lcd.print(":");
  lcdIkkiRaqam(keyingiOyna);
  lcd.print("da yonadi ~");
  lcd.print(qolganDaq);
  lcd.print("d ");
}

// ================================================================
//  RELE BOSHQARUVI
// ================================================================
void boshqarishRele() {
  bool yangiHolat = releHolati;

  if (aeratsiyaRejimi == REJIM_KISLOROD) {
    if (doXato || !doAktivmi) {
      yangiHolat = true;   // xatoda rele yoqiladi (xavfsiz holat)
    } else if (do_x10 < minDo_x10) {
      yangiHolat = true;
    } else if (do_x10 >= (minDo_x10 + farqDo_x10)) {
      yangiHolat = false;
    }
  } else {
    yangiHolat = vaqtRejimiReleHolati();
  }

  // SMS bilan qo'lda majburan yoqish (xavfsiz: faqat YONIQ qiladi, o'chirmaydi)
  if (qolReleYoq) yangiHolat = true;

  if (yangiHolat != releHolati &&
      taymerOtdimi(releOzgarishVaqti, RELE_DEBOUNCE_MS)) {
    releHolati        = yangiHolat;
    releOzgarishVaqti = millis();
    digitalWrite(RELE_PIN, releHolati ? HIGH : LOW);
  }
}

// ================================================================
//  SENSOR O'QISH (navbatma-navbat: DO va pH)
// ================================================================
void readSensorDataSmart() {
  if (qaysiSensorNavbati == 1) {
    qaysiSensorNavbati = 2;
    if (doAktivmi) {
      node.begin(1, modbusSerial);
      if (node.readHoldingRegisters(0x0000, 4) == node.ku8MBSuccess) {
        do_x10 = (int16_t)(node.getResponseBuffer(0) / 10);
        t_x10  = (int16_t)(node.getResponseBuffer(2) / 10);
        doXato = false;
        sensorNosozXabar = false;   // sensor tiklandi -> keyingi nosozlikda SMS qayta yuboriladi
      } else {
        doXato          = true;
        doAktivmi       = false;
        lastDoCheckTime = millis();
      }
    } else {
      doXato = true;
    }
  } else {
    qaysiSensorNavbati = 1;
    if (phAktivmi) {
      node.begin(2, modbusSerial);
      if (node.readHoldingRegisters(0x0000, 2) == node.ku8MBSuccess) {
        ph_x10 = (int16_t)(node.getResponseBuffer(0) / 10);
        phXato = false;
      } else {
        phXato          = true;
        phAktivmi       = false;
        lastPhCheckTime = millis();
      }
    } else {
      phXato = true;
    }
  }
}

// ================================================================
//  XOTIRAGA YOZISH (DO tarixi ring buffer)
// ================================================================
void xotiragaYozish(const DateTime& now) {
  if (doXato || !doAktivmi) return;

  uint8_t head  = eeprom_head_cache;
  uint8_t count = eeprom_count_cache;
  if (head  >= MAX_RECORDS) head  = 0;
  if (count >  MAX_RECORDS) count = 0;

  int16_t clamped = (do_x10 < 0) ? 0 : ((do_x10 > 255) ? 255 : do_x10);
  uint8_t doB = (uint8_t)clamped;

  prefsYozuvSaqla(head, now.hour(), now.minute(),
                  now.day(), now.month(), doB);

  head = (head + 1) % MAX_RECORDS;
  if (count < MAX_RECORDS) count++;

  prefsYozHead(head);
  prefsYozCount(count);
}

// ================================================================
//  DO TARIXI KO'RSATISH (E tugmasi)
//  [BUG #4 TUZATILDI]: delay(2000)+delay(500) orasiga WDT reset qo'shildi
// ================================================================
void doTarixiKorsat() {
  uint8_t head  = eeprom_head_cache;
  uint8_t count = eeprom_count_cache;

  lcd.clear();
  if (count == 0) {
    lcd.setCursor(0, 0); lcd.print("Tarix bo'sh!    ");
    esp_task_wdt_reset();
    delay(1500);
    esp_task_wdt_reset();
    lcd.clear();
    return;
  }

  lcd.setCursor(0, 0); lcd.print("--- DO TARIX ---");
  lcd.setCursor(0, 1); lcd.print("Jami: ");
  lcd.print(count); lcd.print(" yozuv  ");
  esp_task_wdt_reset();
  delay(1500);
  esp_task_wdt_reset();

  uint8_t boshIndeks = (count == MAX_RECORDS) ? head : 0;
  char    qator1[17] = "";

  for (uint8_t i = 0; i < count; i++) {
    esp_task_wdt_reset();
    uint8_t idx = (boshIndeks + i) % MAX_RECORDS;
    uint8_t h, m, kun, oy, doB;
    prefsYozuvOqish(idx, h, m, kun, oy, doB);

    uint8_t doB_tam = doB / 10;
    uint8_t doB_kas = doB % 10;

    // Format: "OY/KUN HH:MM D.D"
    char joriy[17];
    joriy[0]  = '0' + oy  / 10;  joriy[1]  = '0' + oy  % 10;
    joriy[2]  = '/';
    joriy[3]  = '0' + kun / 10;  joriy[4]  = '0' + kun % 10;
    joriy[5]  = ' ';
    joriy[6]  = '0' + h   / 10;  joriy[7]  = '0' + h   % 10;
    joriy[8]  = ':';
    joriy[9]  = '0' + m   / 10;  joriy[10] = '0' + m   % 10;
    joriy[11] = ' ';
    joriy[12] = (doB_tam >= 10) ? ('0' + doB_tam / 10) : ' ';
    joriy[13] = '0' + (doB_tam % 10);
    joriy[14] = '.';
    joriy[15] = '0' + doB_kas;
    joriy[16] = '\0';

    lcd.clear();
    lcd.setCursor(0, 0);
    if (qator1[0] != '\0') lcd.print(qator1);
    lcd.setCursor(0, 1);
    lcd.print(joriy);
    esp_task_wdt_reset();
    delay(2000);
    esp_task_wdt_reset();   // [BUG #4 TUZATILDI]: Bu reset qo'shildi
    delay(500);
    esp_task_wdt_reset();
    memcpy(qator1, joriy, 17);
  }

  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("Tarix tugadi.   ");
  esp_task_wdt_reset();
  delay(1500);
  esp_task_wdt_reset();
  lcd.clear();
  esp_task_wdt_reset();
}

// ================================================================
//  VAQT ORALIQLARINI KO'RSATISH
//  [BUG #5 TUZATILDI]: delay lararo WDT reset qo'shildi
// ================================================================
void vaqtJadvaliniKorsat() {
  lcd.clear();
  if (vaqtOraliqSoni == 0) {
    lcd.setCursor(0, 0); lcd.print("Jadval bo'sh!   ");
    lcd.setCursor(0, 1); lcd.print("R-kiriting      ");
    esp_task_wdt_reset();
    delay(1500);
    esp_task_wdt_reset();
    delay(500);
    esp_task_wdt_reset();
    lcd.clear();
    return;
  }

  lcd.setCursor(0, 0); lcd.print("-- VAQT JADVAL--");
  lcd.setCursor(0, 1); lcd.print("Jami: ");
  lcd.print(vaqtOraliqSoni); lcd.print(" ta     ");
  esp_task_wdt_reset();
  delay(1500);
  esp_task_wdt_reset();

