smartlake26-rgb/smartlake/firmware/aqua_monitor_esp32.ino
  uint8_t ko = 0;
  for (uint8_t i = 0; i < MAX_VAQT_ORALIQ; i++) {
    if (!vaqtJadvali[i].faol) continue;
    esp_task_wdt_reset();
    ko++;
    lcd.clear();
    lcd.setCursor(0, 0);
    lcd.print(ko); lcd.print(": ");
    lcdIkkiRaqam(vaqtJadvali[i].boshH); lcd.print(':');
    lcdIkkiRaqam(vaqtJadvali[i].boshM); lcd.print('-');
    lcdIkkiRaqam(vaqtJadvali[i].oxirH); lcd.print(':');
    lcdIkkiRaqam(vaqtJadvali[i].oxirM);
    lcd.print("    ");
    lcd.setCursor(0, 1);
    lcd.print(vaqtRejimiReleHolati() ? "Hozir: AKTIV    " : "Hozir: -        ");
    esp_task_wdt_reset();
    delay(2000);
    esp_task_wdt_reset();   // [BUG #5 TUZATILDI]: Bu reset qo'shildi
    delay(500);
    esp_task_wdt_reset();
  }

  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("Jadval tugadi.  ");
  esp_task_wdt_reset();
  delay(1500);
  esp_task_wdt_reset();
  lcd.clear();
  esp_task_wdt_reset();
}

// ================================================================
//  L TUGMASI — REJIM TANLASH
//  [BUG #6 TUZATILDI]: lcd.clear() bilan ekran tozalanadi
// ================================================================
void lTugmasiBosildi() {
  if (lTugmaHolati == 0 || taymerOtdimi(lTugmaVaqti, L_TIMEOUT)) {
    lTugmaHolati       = 1;
    lTugmaVaqti        = millis();
    joriyRejimKiritish = 'L';
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("1-Kislorod rejim");
    lcd.setCursor(0, 1); lcd.print("T-tasdiqlash    ");
  } else if (lTugmaHolati == 1) {
    lTugmaHolati = 2;
    lTugmaVaqti  = millis();
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("2-Vaqt rejimi   ");
    lcd.setCursor(0, 1); lcd.print("T-tasdiqlash    ");
  } else {
    lTugmaHolati       = 0;
    joriyRejimKiritish = ' ';
    lcd.clear();
    ekranniYangilash();
  }
}

// ================================================================
//  KLAVIATURA BOSHQARUV
// ================================================================
void klaviaturaBoshqar(char key) {

  if (key == 'L') { lTugmasiBosildi(); return; }

  if (joriyRejimKiritish == 'L') {
    if (key == 'T') {
      if (lTugmaHolati == 1) {
        aeratsiyaRejimi = REJIM_KISLOROD;
        prefs.putUChar("rejim", REJIM_KISLOROD);
        boshlangichRejimda = true;
        boshlangichBosh    = millis();
        tsikilRejim        = TSIKL_ISHLASH;
        oxirgiYozuvKaliti  = 0xFFFF;
        qaysiSensorNavbati = 1;
        joriyRejimKiritish = ' ';
        lTugmaHolati       = 0;
        lcd.clear();
        lcd.setCursor(0, 0); lcd.print("Kislorod rejim  ");
        lcd.setCursor(0, 1); lcd.print("1s boshlang'ich ");
        esp_task_wdt_reset();
        delay(1500);
        esp_task_wdt_reset();
        lcd.clear();
        ekranniYangilash();
      } else if (lTugmaHolati == 2) {
        aeratsiyaRejimi    = REJIM_VAQT;
        prefs.putUChar("rejim", REJIM_VAQT);
        joriyRejimKiritish = ' ';
        lTugmaHolati       = 0;
        lcd.clear();
        lcd.setCursor(0, 0); lcd.print("Vaqt rejimi     ");
        lcd.setCursor(0, 1); lcd.print("tanlandi!       ");
        esp_task_wdt_reset();
        delay(1500);
        esp_task_wdt_reset();
        lcd.clear();
        ekranniYangilash();
      }
    } else if (key == 'R') {
      lTugmaHolati       = 0;
      joriyRejimKiritish = ' ';
      lcd.clear();
      ekranniYangilash();
    }
    return;
  }

  if (key == 'F') {
    if (doAktivmi) runKislorodKalibrlash();
    else           nonBlockXabar("DO datchik yo'q ", 1500);
    return;
  }

  if (key == 'E') {
    if (aeratsiyaRejimi == REJIM_KISLOROD) doTarixiKorsat();
    else                                    vaqtJadvaliniKorsat();
    return;
  }

  if (key == 'D') {
    if (aeratsiyaRejimi == REJIM_VAQT) {
      if (vaqtOraliqSoni == 0) {
        nonBlockXabar("Jadval bo'sh!   ", 1500);
      } else {
        for (int8_t i = MAX_VAQT_ORALIQ - 1; i >= 0; i--) {
          if (vaqtJadvali[i].faol) {
            vaqtJadvali[i].faol = false;
            vaqtOraliqSoni--;
            break;
          }
        }
        vaqtJadvaliniSaqla();
        nonBlockXabar("O'chirildi!     ", 1500);
      }
    }
    return;
  }

  if (key == 'T') {
    // Bo'sh holatda T -> uzun bosish (test) loop'da aniqlanadi.
    // Kiritish faol bo'lsa -> oddiy saqlash (darhol, o'zgarmagan).
    if (joriyRejimKiritish == ' ' && inputLen == 0) {
      tBosildi   = true;
      tBoshVaqti = millis();
    } else {
      saqlashTugmasi();
    }
    return;
  }

  if (key == 'R') {
    if (joriyRejimKiritish != ' ') {
      // faol kiritishni bekor qilish
      inputLen = 0; inputText[0] = '\0';
      joriyRejimKiritish = ' ';
      lcd.setCursor(0, 1); lcd.print("                ");
      lcd.clear();
      ekranniYangilash();
    } else if (aeratsiyaRejimi == REJIM_VAQT) {
      // VAQT rejimi, bo'sh -> vaqt oralig'i kiritish
      if (vaqtOraliqSoni >= MAX_VAQT_ORALIQ) {
        nonBlockXabar("Max 5 ta! D-och ", 2000);
        return;
      }
      joriyRejimKiritish = 'V';
      inputLen = 0; inputText[0] = '\0';
      lcd.clear();
      lcd.setCursor(0, 0); lcd.print("Vaqt: SSDDBBOO  ");
      lcd.setCursor(0, 1); lcd.print("                ");
      lcd.setCursor(0, 1);
    } else {
      // KISLOROD rejimi, bo'sh -> telefon raqami kiritish
      telRaqamKiritishOch();
    }
    return;
  }

  // '#' alohida boshqariladi (bir marta = Min DO, ikki marta = Kritik DO)
  if (key == '#') {
    if (joriyRejimKiritish == '#' && inputLen == 0) {
      // ikkinchi marta '#' (raqam yozilmasdan) -> Kritik DO
      joriyRejimKiritish = 'K';
      lcd.setCursor(0, 1); lcd.print("                ");
      lcd.setCursor(0, 1); lcd.print("Kritik DO(mg/L):");
    } else {
      // birinchi '#' -> Min DO
      joriyRejimKiritish = '#';
      inputLen = 0; inputText[0] = '\0';
      lcd.setCursor(0, 1); lcd.print("                ");
      lcd.setCursor(0, 1); lcd.print("Min DO(mg/L):   ");
    }
    return;
  }

  if (key == 'B' || key == '*' || key == 'U') {
    joriyRejimKiritish = key;
    inputLen = 0; inputText[0] = '\0';
    lcd.setCursor(0, 1); lcd.print("                ");
    lcd.setCursor(0, 1);
    if      (key == 'B') lcd.print("T kiriting(C):  ");
    else if (key == '*') lcd.print("Farq(mg/L):     ");
    else if (key == 'U') {
      lcd.setCursor(0, 0); lcd.print("Vaqt: OOKKSSDD  ");
      lcd.setCursor(0, 1); lcd.print("OO-oy, KK-kun...");
      esp_task_wdt_reset();
      delay(1200);
      esp_task_wdt_reset();
      lcd.setCursor(0, 0); lcd.print("Vaqt: OOKKSSDD  ");
      lcd.setCursor(0, 1); lcd.print("                ");
      lcd.setCursor(0, 1);
    }
    return;
  }

