smartlake26-rgb/smartlake/firmware/aqua_monitor_esp32.ino
  // Bo'sh (idle) holatda '0' bosilsa -> ZAVOD RESET kiritish rejimi.
  // Shu tufayli "000" + T istalgan paytda (hech qaysi menyuga kirmasdan)
  // ishlaydi va qurilmani to'liq standartga qaytaradi.
  if (key == '0' && joriyRejimKiritish == ' ') {
    joriyRejimKiritish = 'Z';
    inputLen = 0;
    inputText[inputLen++] = '0';
    inputText[inputLen]   = '\0';
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("ZAVOD RESET?    ");
    lcd.setCursor(0, 1); lcd.print("T=tasdiq ");
    lcd.print(inputText);
    return;
  }

  // Bo'sh holatda '1' bosilsa -> WiFi sozlash portali (111 + T).
  if (key == '1' && joriyRejimKiritish == ' ') {
    joriyRejimKiritish = 'W';
    inputLen = 0;
    inputText[inputLen++] = '1';
    inputText[inputLen]   = '\0';
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("WiFi sozlash?   ");
    lcd.setCursor(0, 1); lcd.print("T=tasdiq ");
    lcd.print(inputText);
    return;
  }

  if (key >= '0' && key <= '9' && joriyRejimKiritish != ' ') {
    // ZAVOD RESET rejimida faqat '0' qabul qilinadi
    if (joriyRejimKiritish == 'Z' && key != '0') return;
    // WiFi rejimida faqat '1' qabul qilinadi
    if (joriyRejimKiritish == 'W' && key != '1') return;

    uint8_t maxLen;
    if      (joriyRejimKiritish == 'P') maxLen = 9;
    else if (joriyRejimKiritish == 'Z') maxLen = 3;
    else if (joriyRejimKiritish == 'W') maxLen = 3;
    else                                maxLen = 8;

    if (inputLen < maxLen) {
      inputText[inputLen++] = key;
      inputText[inputLen]   = '\0';
    }
    lcd.setCursor(0, 1);
    lcd.print("                ");
    lcd.setCursor(0, 1);

    if (joriyRejimKiritish == 'V') {
      for (uint8_t i = 0; i < inputLen; i++) {
        if (i == 2) lcd.print(':');
        else if (i == 4) lcd.print('-');
        else if (i == 6) lcd.print(':');
        lcd.print(inputText[i]);
      }
    } else if (joriyRejimKiritish == 'U') {
      for (uint8_t i = 0; i < inputLen; i++) {
        if (i == 2) lcd.print('/');
        else if (i == 4) lcd.print(' ');
        else if (i == 6) lcd.print(':');
        lcd.print(inputText[i]);
      }
    } else if (joriyRejimKiritish == 'P') {
      lcd.print("+998"); lcd.print(inputText);
    } else if (joriyRejimKiritish == 'Z') {
      lcd.print("T=tasdiq "); lcd.print(inputText);
    } else if (joriyRejimKiritish == 'W') {
      lcd.print("T=tasdiq "); lcd.print(inputText);
    } else {
      if      (joriyRejimKiritish == 'B') lcd.print("T:");
      else if (joriyRejimKiritish == '#') lcd.print("MinDO:");
      else if (joriyRejimKiritish == 'K') lcd.print("Krit:");
      else if (joriyRejimKiritish == '*') lcd.print("Farq:");
      lcd.print(inputText);
    }
  }
}

// ================================================================
//  SAQLASH TUGMASI (T)
// ================================================================
void saqlashTugmasi() {
  if (inputLen == 0) {
    nonBlockXabar("Qiymat yo'q!   ", 1500); return;
  }

  // 000T → standartga qaytarish (to'liq zavod reseti)
  if (inputLen == 3 &&
      inputText[0] == '0' && inputText[1] == '0' && inputText[2] == '0') {
    inputLen = 0; inputText[0] = '\0';
    joriyRejimKiritish = ' ';
    standartgaQaytarish();
    ekranniYangilash();
    return;
  }

  // ZAVOD RESET rejimida "000" dan boshqa narsa kiritilsa -> bekor qilamiz
  if (joriyRejimKiritish == 'Z') {
    inputLen = 0; inputText[0] = '\0';
    joriyRejimKiritish = ' ';
    nonBlockXabar("Reset bekor     ", 1500);
    return;
  }

  // 111T → WiFi sozlash portalini ochish (faqat WiFi rejimida)
  if (joriyRejimKiritish == 'W' && inputLen == 3 &&
      inputText[0] == '1' && inputText[1] == '1' && inputText[2] == '1') {
    inputLen = 0; inputText[0] = '\0';
    joriyRejimKiritish = ' ';
    wifiPortalBoshla();
    return;
  }
  // WiFi rejimida "111" dan boshqa narsa -> bekor
  if (joriyRejimKiritish == 'W') {
    inputLen = 0; inputText[0] = '\0';
    joriyRejimKiritish = ' ';
    nonBlockXabar("WiFi bekor      ", 1500);
    return;
  }

  int val = atoi(inputText);

  // ----------------------------------------------------------
  //  VAQT ORALIG'I (V rejimi)
  // ----------------------------------------------------------
  if (joriyRejimKiritish == 'V') {
    if (inputLen != 8) {
      nonBlockXabar("8 raqam: SSDDBBOO", 2000); return;
    }
    uint8_t bH = (inputText[0]-'0')*10 + (inputText[1]-'0');
    uint8_t bM = (inputText[2]-'0')*10 + (inputText[3]-'0');
    uint8_t oH = (inputText[4]-'0')*10 + (inputText[5]-'0');
    uint8_t oM = (inputText[6]-'0')*10 + (inputText[7]-'0');

    if (bH >= 24 || bM >= 60 || oH >= 24 || oM >= 60) {
      nonBlockXabar("Vaqt noto'g'ri! ", 2000); return;
    }
    if (bH == oH && bM == oM) {
      nonBlockXabar("Bosh=Oxir xato! ", 2000); return;
    }

    bool saqlandi = false;
    for (uint8_t i = 0; i < MAX_VAQT_ORALIQ; i++) {
      if (!vaqtJadvali[i].faol) {
        vaqtJadvali[i] = {bH, bM, oH, oM, true};
        vaqtOraliqSoni++;
        saqlandi = true;
        break;
      }
    }

    if (!saqlandi) {
      nonBlockXabar("Max 5 ta! D-och ", 2000); return;
    }

    vaqtJadvaliniSaqla();
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("Saqlandi:       ");
    lcd.setCursor(0, 1);
    lcdIkkiRaqam(bH); lcd.print(':'); lcdIkkiRaqam(bM);
    lcd.print('-');
    lcdIkkiRaqam(oH); lcd.print(':'); lcdIkkiRaqam(oM);
    lcd.print("      ");
    esp_task_wdt_reset();
    delay(1500);
    esp_task_wdt_reset();
    delay(500);
    esp_task_wdt_reset();
    lcd.clear();
    inputLen = 0; inputText[0] = '\0';
    joriyRejimKiritish = ' ';
    ekranniYangilash();
    return;
  }

  // ----------------------------------------------------------
  //  RTC SOZLASH (U rejimi) — OOKKSSDD format
  // ----------------------------------------------------------
  if (joriyRejimKiritish == 'U') {
    if (inputLen != 8) {
      nonBlockXabar("8 raqam: OOKKSSDD", 2000); return;
    }
    uint8_t oy   = (inputText[0]-'0')*10 + (inputText[1]-'0');
    uint8_t kun  = (inputText[2]-'0')*10 + (inputText[3]-'0');
    uint8_t soat = (inputText[4]-'0')*10 + (inputText[5]-'0');
    uint8_t daq  = (inputText[6]-'0')*10 + (inputText[7]-'0');

