smartlake26-rgb/smartlake/firmware/aqua_monitor_esp32.ino
    if (oy < 1 || oy > 12) {
      nonBlockXabar("Oy 01-12 bo'lsin", 2000); return;
    }

    DateTime now = rtc.now();
    uint16_t yil = now.year();
    uint8_t maxKun = oyningKunlari(oy, yil);
    if (maxKun == 0 || kun < 1 || kun > maxKun) {
      nonBlockXabar("Kun xato!       ", 2000); return;
    }
    if (soat >= 24 || daq >= 60) {
      nonBlockXabar("Soat/daqiqa xato", 2000); return;
    }

    rtc.adjust(DateTime(yil, oy, kun, soat, daq, 0));
    oxirgiYozuvKaliti = 0xFFFF;   // RTC o'zgandi → kalit reset

    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("Vaqt saqlandi:  ");
    lcd.setCursor(0, 1);
    lcdIkkiRaqam(oy); lcd.print('/');
    lcdIkkiRaqam(kun); lcd.print(' ');
    lcdIkkiRaqam(soat); lcd.print(':');
    lcdIkkiRaqam(daq);
    lcd.print("   ");
    esp_task_wdt_reset();
    delay(1500);
    esp_task_wdt_reset();
    lcd.clear();
    inputLen = 0; inputText[0] = '\0';
    joriyRejimKiritish = ' ';
    ekranniYangilash();
    return;
  }

  // ----------------------------------------------------------
  //  HARORAT KALIBRLASH (B rejimi)
  // ----------------------------------------------------------
  if (joriyRejimKiritish == 'B') {
    if (val < 0 || val > 50) {
      nonBlockXabar("0-50 oralig'i! ", 2500);
    } else {
      kiritilganHarorat = (int8_t)val;
      runHaroratKalibrlash();
    }
    return;
  }

  // ----------------------------------------------------------
  //  MIN DO SOZLASH (#)
  // ----------------------------------------------------------
  if (joriyRejimKiritish == '#') {
    if (val < 1 || val > 20) {
      nonBlockXabar("1-20 mg/L !    ", 2000); return;
    }
    minDo_x10 = (int16_t)(val * 10);
    prefs.putShort("minDo", minDo_x10);
    nonBlockXabar("Min DO saqlandi", 1500);
    return;
  }

  // ----------------------------------------------------------
  //  FARQ SOZLASH (*)
  // ----------------------------------------------------------
  if (joriyRejimKiritish == '*') {
    if (val < 1 || val > 10) {
      nonBlockXabar("1-10 mg/L !    ", 2000); return;
    }
    farqDo_x10 = (int16_t)(val * 10);
    prefs.putShort("farqDo", farqDo_x10);
    nonBlockXabar("Farq saqlandi  ", 1500);
    return;
  }

  // ----------------------------------------------------------
  //  KRITIK DO SOZLASH (## -> K) — qo'ng'iroq chegarasi
  // ----------------------------------------------------------
  if (joriyRejimKiritish == 'K') {
    if (val < 1 || val > 20) {
      nonBlockXabar("1-20 mg/L !    ", 2000); return;
    }
    kritikDo_x10 = (int16_t)(val * 10);
    prefs.putShort("kritikDo", kritikDo_x10);
    // alarm holatini yangidan baholash uchun epizodni reset qilamiz
    alarmFaol = false; alarmTasdiq = false;
    if (kritikDo_x10 >= minDo_x10)
      nonBlockXabar("Ogoh:kritik>=min", 2500);
    else
      nonBlockXabar("Kritik DO saqlan", 1500);
    return;
  }

  // ----------------------------------------------------------
  //  TELEFON RAQAMI (R -> P) — 9 raqam, +998 avtomatik
  // ----------------------------------------------------------
  if (joriyRejimKiritish == 'P') {
    if (inputLen != 9) {
      nonBlockXabar("9 ta raqam kerak", 2000); return;
    }
    snprintf(telRaqam, sizeof(telRaqam), "+998%s", inputText);
    prefs.putString("tel", telRaqam);
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("Tel saqlandi:   ");
    lcd.setCursor(0, 1); lcd.print(telRaqam);
    esp_task_wdt_reset();
    delay(1500);
    esp_task_wdt_reset();
    lcd.clear();
    inputLen = 0; inputText[0] = '\0';
    joriyRejimKiritish = ' ';
    ekranniYangilash();
    return;
  }
}

// ================================================================
//  DO KALIBRLASH
// ================================================================
void runKislorodKalibrlash() {
  isCalibrating = true;
  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("DO KALIBR...    ");
  esp_task_wdt_reset();
  delay(500);
  esp_task_wdt_reset();

  node.begin(1, modbusSerial);
  uint8_t result = node.writeSingleRegister(0x1004, 0);

  lcd.clear();
  lcd.setCursor(0, 0);
  if (result == node.ku8MBSuccess) lcd.print("DO OK           ");
  else { lcd.print("Xato: 0x"); lcd.print(result, HEX); }
  esp_task_wdt_reset();
  delay(2000);
  esp_task_wdt_reset();
  delay(500);
  esp_task_wdt_reset();

  lcd.clear();
  inputLen = 0; inputText[0] = '\0';
  joriyRejimKiritish = ' ';
  isCalibrating = false;
}

// ================================================================
//  HARORAT KALIBRLASH
// ================================================================
void runHaroratKalibrlash() {
  isCalibrating = true;
  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("T KALIBR...     ");
  lcd.setCursor(0, 1); lcd.print(kiritilganHarorat); lcd.print(" C");
  esp_task_wdt_reset();
  delay(800);
  esp_task_wdt_reset();

  node.begin(1, modbusSerial);
  uint8_t result = node.writeSingleRegister(
    0x1010, (uint16_t)((uint8_t)kiritilganHarorat * 10));

  lcd.clear();
  lcd.setCursor(0, 0);
  if (result == node.ku8MBSuccess) lcd.print("T OK            ");
  else { lcd.print("Xato: 0x"); lcd.print(result, HEX); }
  esp_task_wdt_reset();
  delay(2000);
  esp_task_wdt_reset();

  lcd.clear();
  inputLen = 0; inputText[0] = '\0';
  kiritilganHarorat  = -1;
  joriyRejimKiritish = ' ';
  isCalibrating = false;
}

// ================================================================
//  ============   GSM / SIM800L   ============
//  To'liq NON-BLOCKING. Hech bir funksiya loop'ni bloklamaydi.
//  AT buyruqlari yuboriladi, javob keyingi loop'larda o'qiladi.
//
//  ESLATMA: SIM800L modulingiz 115200 baud da bo'lsa, quyidagi
//  simSerial.begin dagi 9600 ni 115200 ga o'zgartiring (yoki bir marta
//  AT+IPR=9600 yuborib modulni 9600 ga qotiring).
// ================================================================

// UART dan kelgan baytlarni simBuf ga yig'ish (overflow-safe)
void simBuferGa() {
  while (simSerial.available()) {
    char c = (char)simSerial.read();
    if (c == '\0') continue;
    if (simBufLen < sizeof(simBuf) - 1) {
      simBuf[simBufLen++] = c;
      simBuf[simBufLen]   = '\0';
    } else {
      // bufer to'ldi — oldingi yarmini tashlab, joy bo'shatamiz
      uint16_t yarim = (sizeof(simBuf) - 1) / 2;
      memmove(simBuf, simBuf + yarim, simBufLen - yarim + 1);
      simBufLen -= yarim;
      simBuf[simBufLen++] = c;
      simBuf[simBufLen]   = '\0';
    }
  }
}

inline void simBuferTozala() { simBufLen = 0; simBuf[0] = '\0'; }

bool simJavobBor(const char* token) { return (strstr(simBuf, token) != NULL); }

void simYuborln(const char* s) { simSerial.print(s); simSerial.write('\r'); }

