smartlake26-rgb/smartlake/firmware/aqua_monitor_esp32.ino
// SMS navbatiga matn qo'shish
bool smsNavbatgaQosh(const char* matn) {
  if (telRaqam[0] == '\0') return false;
  if (smsSon >= SMS_NAVBAT) return false;        // navbat to'la
  uint8_t idx = (smsBosh + smsSon) % SMS_NAVBAT;
  strncpy(smsNavbat[idx], matn, SMS_MAX_UZUN - 1);
  smsNavbat[idx][SMS_MAX_UZUN - 1] = '\0';
  smsSon++;
  return true;
}

// Qo'ng'iroq so'rovi (alarm yoki test)
void qongiroqSorov(bool test) {
  if (telRaqam[0] == '\0') return;
  qongPending = true;
  qongTest    = test;
}

// SIM modulni RST orqali qayta tiklash (kamdan-kam, modul osilsa)
void simResetModul() {
  digitalWrite(SIM_RST_PIN, LOW);
  esp_task_wdt_reset();
  delay(120);                 // qisqa impuls (kamyob hodisa, WDT xavfsiz)
  esp_task_wdt_reset();
  digitalWrite(SIM_RST_PIN, HIGH);
  simBuferTozala();
  simHolat       = SIM_KUT;
  simBoshVaqti   = millis();
  simHolatVaqti  = millis();
  simTayyormi    = false;
  simInitBosqich = 0;
  simUrinish     = 0;
  simSignal      = 99;
}

void simBoshlash() {
  pinMode(SIM_RST_PIN, OUTPUT);
  digitalWrite(SIM_RST_PIN, HIGH);     // RST faol emas
  simSerial.begin(9600, SERIAL_8N1, SIM_RX_PIN, SIM_TX_PIN);
  simBuferTozala();
  simHolat       = SIM_KUT;
  simBoshVaqti   = millis();
  simHolatVaqti  = millis();
  simTayyormi    = false;
  simInitBosqich = 0;
  simUrinish     = 0;
  simSignal      = 99;
}

// ================================================================
//  SIM HOLAT MASHINASI — har loop'da chaqiriladi
// ================================================================
void simYangilash() {
  simBuferGa();
  unsigned long hozir = millis();

  switch (simHolat) {

    // -------- Modul ishga tushishini kutish --------
    case SIM_KUT:
      if (taymerOtdimi(simBoshVaqti, 4000UL)) {
        simBuferTozala();
        simYuborln("AT");
        simInitBosqich = 0;
        simUrinish     = 0;
        simHolat       = SIM_INIT;
        simHolatVaqti  = hozir;
      }
      break;

    // -------- Boshlang'ich sozlash --------
    case SIM_INIT:
      if (simJavobBor("OK")) {
        simInitBosqich++;
        simBuferTozala();
        switch (simInitBosqich) {
          case 1: simYuborln("ATE0");          break;  // echo o'chirish
          case 2: simYuborln("AT+CMGF=1");     break;  // SMS text rejimi
          case 3: simYuborln("AT+CSCS=\"GSM\"");break; // belgilar to'plami
          case 4: simYuborln("AT+CLIP=1");     break;  // qo'ng'iroq holati
          case 5: simYuborln("AT+CNMI=2,2,0,0,0"); break; // kiruvchi SMS -> darhol UART
          default:
            simBuferTozala();
            simYuborln("AT+CREG?");
            simUrinish    = 0;
            simHolat      = SIM_TARMOQ;
            break;
        }
        simHolatVaqti = hozir;
      } else if (taymerOtdimi(simHolatVaqti, 3000UL)) {
        simUrinish++;
        if (simUrinish >= 5) { simResetModul(); break; }
        simBuferTozala();
        simYuborln("AT");
        simInitBosqich = 0;
        simHolatVaqti  = hozir;
      }
      break;

    // -------- Tarmoqqa ro'yxatdan o'tish --------
    case SIM_TARMOQ:
      // +CREG: 0,1 (uy) yoki 0,5 (roaming) = ulangan
      if (simJavobBor(",1") || simJavobBor(",5")) {
        simTayyormi   = true;
        simBuferTozala();
        simCsqVaqti   = 0;          // darhol signal so'rash
        simHolat      = SIM_TAYYOR;
        simHolatVaqti = hozir;
      } else if (taymerOtdimi(simHolatVaqti, 3000UL)) {
        simBuferTozala();
        simYuborln("AT+CREG?");
        simHolatVaqti = hozir;
        simUrinish++;
        if (simUrinish > 40) simResetModul();   // ~2 daqiqa ulanmasa reset
      }
      break;

    // -------- Bo'sh / ishga tayyor --------
    case SIM_TAYYOR: {
      // Kiruvchi qo'ng'iroq bo'lsa, uni rad etamiz (modulni band qilmasin)
      if (simJavobBor("RING")) { simYuborln("ATH"); simBuferTozala(); break; }

      // Kiruvchi SMS buyrug'i (+CMT push, CNMI=2,2). Faqat bo'sh holatda o'qiymiz.
      char* cmt = strstr(simBuf, "+CMT:");
      if (cmt) {
        char* nl = strchr(cmt, '\n');
        if (nl) {
          char tana[64]; uint8_t k = 0; nl++;
          while (*nl && *nl != '\r' && *nl != '\n' && k < sizeof(tana) - 1)
            tana[k++] = *nl++;
          tana[k] = '\0';
          if (k > 0) smsBuyruqniQolla(tana);
        }
        simBuferTozala();
        break;
      }

      // CSQ (signal) javobini tahlil qilish
      char* p = strstr(simBuf, "+CSQ:");
      if (p) {
        simSignal = (uint8_t)atoi(p + 5);
        simBuferTozala();
      }

      // 1) SMS navbati (SMS doim qo'ng'iroqdan oldin ketadi)
      if (smsSon > 0) {
        char buyruq[40];
        snprintf(buyruq, sizeof(buyruq), "AT+CMGS=\"%s\"", telRaqam);
        simBuferTozala();
        simYuborln(buyruq);
        simHolat      = SIM_SMS_CMGS;
        simHolatVaqti = hozir;
      }
      // 2) Qo'ng'iroq
      else if (qongPending) {
        qongPending = false;
        char buyruq[24];
        snprintf(buyruq, sizeof(buyruq), "ATD%s;", telRaqam);
        simBuferTozala();
        simYuborln(buyruq);
        qongJavobBerildi = false;
        simHolat      = SIM_QONG_TER;
        simHolatVaqti = hozir;
      }
      // 3) Internet telemetriya — SIM orqali (loop rejasi so'rasa: WiFi yo'q/uzilgan)
      else if (simTelemSora) {
        simTelemSora = false;
        httpBosqich = 0;
        simBuferTozala();
        simYuborln("AT+SAPBR=3,1,\"Contype\",\"GPRS\"");
        simHolat      = SIM_NET_BEARER;
        simHolatVaqti = hozir;
      }
      // 4) Bo'sh bo'lsa — signalni davriy yangilash
      else if (taymerOtdimi(simCsqVaqti, 10000UL)) {
        simCsqVaqti = hozir;
        simBuferTozala();
        simYuborln("AT+CSQ");
      }
      break;
    }

    // -------- GPRS bearer + HTTP sozlash (matnli AT, har bosqich OK kutadi) --------
    case SIM_NET_BEARER:
      if (simJavobBor("OK") || simJavobBor("ERROR")) {
        httpBosqich++;
        simBuferTozala();
        char b[176];
        switch (httpBosqich) {
          case 1:
            snprintf(b, sizeof(b), "AT+SAPBR=3,1,\"APN\",\"%s\"", GPRS_APN);
            simYuborln(b); break;
          case 2: simYuborln("AT+SAPBR=1,1");            break;  // bearer ochish (sekin)
          case 3: simYuborln("AT+HTTPINIT");             break;
          case 4: simYuborln("AT+HTTPPARA=\"CID\",1");   break;
          case 5:
            snprintf(b, sizeof(b),
              "AT+HTTPPARA=\"URL\",\"%s\"", FB_SIM_RELAY);
            simYuborln(b); break;
          case 6: simYuborln("AT+HTTPPARA=\"CONTENT\",\"application/json\""); break;
          case 7:
            snprintf(b, sizeof(b), "AT+HTTPDATA=%u,8000", (unsigned)strlen(telemetriyaBuf));
            simYuborln(b);
            simHolat = SIM_HTTP_TELEM;      // endi "DOWNLOAD" kutamiz
            break;
          default:
            simHolat = SIM_TAYYOR;          // kutilmagan holat — xavfsiz qaytish
            break;
        }
        simHolatVaqti = hozir;
      } else if (taymerOtdimi(simHolatVaqti, 15000UL)) {
        // bearer/HTTP sekin yoki nosoz — bekor qilib, TAYYOR ga qaytamiz (best-effort)
        simBuferTozala();
        simYuborln("AT+HTTPTERM");
        simHolat      = SIM_TAYYOR;
        simHolatVaqti = hozir;
      }
      break;

