smartlake26-rgb/smartlake/firmware/aqua_monitor_esp32.ino
    // -------- HTTP telemetriya: DOWNLOAD -> JSON -> HTTPACTION -> TERM --------
    case SIM_HTTP_TELEM:
      if (httpBosqich == 7) {                       // "DOWNLOAD" kutamiz
        if (simJavobBor("DOWNLOAD")) {
          simSerial.print(telemetriyaBuf);          // JSON tanasini yuboramiz
          simBuferTozala();
          httpBosqich   = 8;
          simHolatVaqti = hozir;
        } else if (taymerOtdimi(simHolatVaqti, 8000UL)) {
          simBuferTozala(); simYuborln("AT+HTTPTERM");
          simHolat = SIM_TAYYOR; simHolatVaqti = hozir;
        }
      } else if (httpBosqich == 8) {                // data yozildi, OK -> HTTPACTION
        if (simJavobBor("OK")) {
          simBuferTozala();
          simYuborln("AT+HTTPACTION=1");
          httpBosqich   = 9;
          simHolatVaqti = hozir;
        } else if (taymerOtdimi(simHolatVaqti, 8000UL)) {
          simBuferTozala(); simYuborln("AT+HTTPTERM");
          simHolat = SIM_TAYYOR; simHolatVaqti = hozir;
        }
      } else {                                      // ACTION natijasi yoki timeout
        if (simJavobBor("+HTTPACTION:") || simJavobBor("ERROR")) {
          simBuferTozala();
          simYuborln("AT+HTTPTERM");
          simHolat      = SIM_TAYYOR;
          simHolatVaqti = hozir;
        } else if (taymerOtdimi(simHolatVaqti, 20000UL)) {
          simBuferTozala(); simYuborln("AT+HTTPTERM");
          simHolat = SIM_TAYYOR; simHolatVaqti = hozir;
        }
      }
      break;

    // -------- SMS: ">" promptini kutish --------
    case SIM_SMS_CMGS:
      if (simJavobBor(">")) {
        simSerial.print(smsNavbat[smsBosh]);
        simSerial.write(26);              // Ctrl-Z = yuborish
        simBuferTozala();
        simHolat      = SIM_SMS_TANA;
        simHolatVaqti = hozir;
      } else if (taymerOtdimi(simHolatVaqti, 5000UL)) {
        simSerial.write(27);              // ESC = bekor
        smsBosh = (smsBosh + 1) % SMS_NAVBAT;
        if (smsSon) smsSon--;
        simBuferTozala();
        simHolat      = SIM_TAYYOR;
        simHolatVaqti = hozir;
      }
      break;

    // -------- SMS: yuborilishini kutish --------
    case SIM_SMS_TANA:
      if (simJavobBor("+CMGS:") || simJavobBor("OK")) {
        smsBosh = (smsBosh + 1) % SMS_NAVBAT;
        if (smsSon) smsSon--;
        simBuferTozala();
        simHolat      = SIM_TAYYOR;
        simHolatVaqti = hozir;
      } else if (simJavobBor("ERROR") || taymerOtdimi(simHolatVaqti, 12000UL)) {
        smsBosh = (smsBosh + 1) % SMS_NAVBAT;     // bu SMS ni tashlab ketamiz
        if (smsSon) smsSon--;
        simBuferTozala();
        simHolat      = SIM_TAYYOR;
        simHolatVaqti = hozir;
      }
      break;

    // -------- Qo'ng'iroq: ATD javobini kutish --------
    case SIM_QONG_TER:
      if (simJavobBor("OK")) {
        simBuferTozala();
        qongKuzatBosh = hozir;
        simHolat      = SIM_QONG_KUZAT;
        simHolatVaqti = hozir;
      } else if (simJavobBor("ERROR") || simJavobBor("NO DIAL") ||
                 taymerOtdimi(simHolatVaqti, 5000UL)) {
        simBuferTozala();
        simHolat      = SIM_TAYYOR;
        simHolatVaqti = hozir;
      }
      break;

    // -------- Qo'ng'iroq: javob/tugashini kuzatish --------
    case SIM_QONG_KUZAT:
      // CLCC: "+CLCC: 1,0,0,..." -> stat=0 = JAVOB BERILDI
      if (strstr(simBuf, "+CLCC: 1,0,0")) {
        qongJavobBerildi = true;
        alarmTasdiq      = true;          // fermer javob berdi -> qayta qo'ng'iroq yo'q
        simYuborln("ATH");
        simBuferTozala();
        simHolat      = SIM_TAYYOR;
        simHolatVaqti = hozir;
      }
      // Qo'ng'iroq tugadi (javobsiz / band / rad)
      else if (simJavobBor("NO CARRIER") || simJavobBor("NO ANSWER") ||
               simJavobBor("BUSY")       || simJavobBor("NO DIALTONE")) {
        simBuferTozala();
        simHolat      = SIM_TAYYOR;
        simHolatVaqti = hozir;
      }
      // Davriy CLCC so'rovi (har ~1.5s)
      else if (taymerOtdimi(simHolatVaqti, 1500UL)) {
        simHolatVaqti = hozir;
        simBuferTozala();
        simYuborln("AT+CLCC");
      }
      // Jiringlash timeouti (~28s) -> uzamiz
      if (taymerOtdimi(qongKuzatBosh, 28000UL) && simHolat == SIM_QONG_KUZAT) {
        simYuborln("ATH");
        simBuferTozala();
        simHolat      = SIM_TAYYOR;
        simHolatVaqti = hozir;
      }
      break;

    default:
      simHolat = SIM_TAYYOR;
      break;
  }
}

// ================================================================
//  ALARM — DO ni kritik bilan solishtirish (sensor o'qilgach chaqiriladi)
//  Bu yerda faqat EPIZOD boshlash va tiklanish. Qayta qo'ng'iroqni
//  alarmQaytaQong() boshqaradi (10 daqiqalik, soatiga 3 marta).
// ================================================================
void alarmniTekshir() {
  if (kritikDo_x10 <= 0 || telRaqam[0] == '\0') return;
  if (doXato || !doAktivmi) return;     // DO yo'q bo'lsa solishtirmaymiz

  if (do_x10 < kritikDo_x10) {
    if (!alarmFaol) {
      // ----- YANGI ALARM EPIZODI -----
      DateTime now = rtc.now();
      alarmFaol   = true;
      alarmTasdiq = false;

      char msg[SMS_MAX_UZUN];
      snprintf(msg, sizeof(msg),
        "KRITIK! DO=%d.%d<%d.%d mg/L %02d:%02d Aerator:%s",
        do_x10 / 10, do_x10 % 10, kritikDo_x10 / 10, kritikDo_x10 % 10,
        now.hour(), now.minute(), releHolati ? "ON" : "OFF");
      smsNavbatgaQosh(msg);     // 1) avval SMS
      qongiroqSorov(false);     // 2) keyin qo'ng'iroq

      alarmQongSoat   = now.hour();
      alarmQongSoni   = 1;
      alarmOxirgiQong = millis();
    }
    // alarmFaol bo'lsa: qayta qo'ng'iroqni alarmQaytaQong() boshqaradi
  }
  else if (do_x10 >= kritikDo_x10 + ALARM_REARM_OFFSET_X10) {
    if (alarmFaol) {
      // ----- TIKLANDI -----
      DateTime now = rtc.now();
      alarmFaol   = false;
      alarmTasdiq = false;
      char msg[SMS_MAX_UZUN];
      snprintf(msg, sizeof(msg),
        "Normaga qaytdi. DO=%d.%d mg/L %02d:%02d",
        do_x10 / 10, do_x10 % 10, now.hour(), now.minute());
      smsNavbatgaQosh(msg);
    }
  }
}

// ================================================================
//  QAYTA QO'NG'IROQ — har loop'da, taymer bilan (o'lchov oynasiga bog'liq emas)
//  Har 10 daqiqada, soatiga maksimum 3 marta, fermer javob bermaguncha.
// ================================================================
void alarmQaytaQong() {
  if (!alarmFaol || alarmTasdiq) return;
  if (telRaqam[0] == '\0' || kritikDo_x10 <= 0) return;
  if (!taymerOtdimi(alarmOxirgiQong, ALARM_QONG_ORALIQ_MS)) return;

  uint8_t soat = rtc.now().hour();
  if (soat != alarmQongSoat) {        // soat almashdi -> hisob yangilanadi
    alarmQongSoat = soat;
    alarmQongSoni = 0;
  }
  alarmOxirgiQong = millis();         // keyingi 10 daqiqani qayta boshlash
  if (alarmQongSoni < ALARM_MAX_QONG_SOAT) {
    qongiroqSorov(false);
    alarmQongSoni++;
  }
}

// ================================================================
//  SENSOR NOSOZLIGI XABARI — DO sensor o'lsa bir marta SMS
// ================================================================
void sensorNosozTekshir() {
  if (aeratsiyaRejimi != REJIM_KISLOROD) return;
  if (telRaqam[0] == '\0') return;
  // !doAktivmi = tasdiqlangan nosozlik (retry paytida ham false bo'lib qolmaydi)
  if (!doAktivmi && !sensorNosozXabar) {
    DateTime now = rtc.now();
    char msg[SMS_MAX_UZUN];
    snprintf(msg, sizeof(msg),
      "DIQQAT! DO sensor nosoz %02d:%02d. Aerator avto-ON.",
      now.hour(), now.minute());
    smsNavbatgaQosh(msg);
    sensorNosozXabar = true;
  }
  // tiklanish bayrog'i readSensorDataSmart ichida (muvaffaqiyatli o'qishda) tozalanadi
}

// ================================================================
//  SOATLIK HOLAT SMS — xotiraga yozilgandan keyin chaqiriladi
// ================================================================
void soatlikSmsTekshir(const DateTime& now) {
  if (aeratsiyaRejimi != REJIM_KISLOROD) return;
  if (telRaqam[0] == '\0') return;
  if (doXato || !doAktivmi) return;
  uint16_t kalit = yozuvKalitHisopla(now.month(), now.day(), now.hour());
  if (kalit == oxirgiSmsKaliti) return;
  oxirgiSmsKaliti = kalit;

  char msg[SMS_MAX_UZUN];
  if (!phXato && phAktivmi) {
    snprintf(msg, sizeof(msg),
      "Aqua %02d/%02d %02d:%02d DO=%d.%d T=%d.%d pH=%d.%d Aer:%s",
      now.month(), now.day(), now.hour(), now.minute(),
      do_x10/10, do_x10%10, t_x10/10, t_x10%10, ph_x10/10, ph_x10%10,
      releHolati ? "ON" : "OFF");
  } else {
    snprintf(msg, sizeof(msg),
      "Aqua %02d/%02d %02d:%02d DO=%d.%d T=%d.%d Aer:%s",
      now.month(), now.day(), now.hour(), now.minute(),
      do_x10/10, do_x10%10, t_x10/10, t_x10%10,
      releHolati ? "ON" : "OFF");
  }
  smsNavbatgaQosh(msg);
}

// ================================================================
//  LCD SIGNAL KO'RSATKICHI (14-15 katak): antenna + 0..4 panjara
// ================================================================
void simSignalCharlarYarat() {
  uint8_t antenna[8] = {0b00100,0b01110,0b10101,0b00100,0b00100,0b00100,0b01110,0b00000};
  uint8_t s0[8] = {0,0,0,0,0,0,0,0b10101};                         // signal yo'q
  uint8_t s1[8] = {0,0,0,0,0,0,0b11111,0b11111};                   // 1
  uint8_t s2[8] = {0,0,0,0,0b11111,0b11111,0b11111,0b11111};       // 2
  uint8_t s3[8] = {0,0,0b11111,0b11111,0b11111,0b11111,0b11111,0b11111}; // 3
  uint8_t s4[8] = {0b11111,0b11111,0b11111,0b11111,0b11111,0b11111,0b11111,0b11111}; // 4
  lcd.createChar(0, antenna);
  lcd.createChar(1, s0);
  lcd.createChar(2, s1);
  lcd.createChar(3, s2);
  lcd.createChar(4, s3);
  lcd.createChar(5, s4);
}

void signalniLCDgaChiz() {
  if (wifiPortalAktiv) return;
  if (joriyRejimKiritish != ' ') return;
  if (!boshlangichRejimda && aeratsiyaRejimi == REJIM_KISLOROD &&
      tsikilRejim == TSIKL_UXLASH) return;

  uint8_t bar;
  if (!simTayyormi || simSignal == 99 || simSignal == 0) bar = 0;
  else if (simSignal <= 5)  bar = 1;
  else if (simSignal <= 10) bar = 2;
  else if (simSignal <= 15) bar = 3;
  else                      bar = 4;

  lcd.setCursor(14, 1);
  lcd.write((uint8_t)0);              // antenna
  lcd.write((uint8_t)(1 + bar));      // panjara (1=0bar ... 5=4bar)
}

// ================================================================
//  TELEFON RAQAMI KIRITISHNI OCHISH (R tugmasi, KISLOROD rejimi)
// ================================================================
void telRaqamKiritishOch() {
  joriyRejimKiritish = 'P';
  inputLen = 0; inputText[0] = '\0';
  lcd.clear();
  lcd.setCursor(0, 0);
  if (telRaqam[0] != '\0') lcd.print("Eski raqam:     ");
  else                     lcd.print("Tel(9 raqam):   ");
  lcd.setCursor(0, 1);
  if (telRaqam[0] != '\0') lcd.print(telRaqam);   // +998... (13 belgi, sig'adi)
  else                     lcd.print("+998_________   ");
  lcd.setCursor(0, 1);
}

// ================================================================
//  QURILMA ID — ESP32 chip ID dan (o'zgarmas, har chipda noyob)
//  Masalan: "AQ7F8A2C". Simkarta almashsa ham o'zgarmaydi.
// ================================================================
void deviceIdYarat() {
  uint64_t mac = ESP.getEfuseMac();
  uint32_t low = (uint32_t)(mac & 0xFFFFFFUL);   // oxirgi 24 bit
  snprintf(deviceId, sizeof(deviceId), "AQ%06X", (unsigned)low);
}

// ================================================================
//  TELEMETRIYA JSON — ThingsBoard uchun
// ================================================================
void telemetriyaTayyorla() {
  int rele = releHolati ? 1 : 0;
  if (!phXato && phAktivmi) {
    snprintf(telemetriyaBuf, sizeof(telemetriyaBuf),
      "{\"id\":\"%s\",\"do\":%d.%d,\"ph\":%d.%d,\"t\":%d.%d,\"aer\":%d}",
      deviceId, do_x10 / 10, do_x10 % 10, ph_x10 / 10, ph_x10 % 10,
      t_x10 / 10, t_x10 % 10, rele);
  } else {
    snprintf(telemetriyaBuf, sizeof(telemetriyaBuf),
      "{\"id\":\"%s\",\"do\":%d.%d,\"t\":%d.%d,\"aer\":%d}",
      deviceId, do_x10 / 10, do_x10 % 10, t_x10 / 10, t_x10 % 10, rele);
  }
}

// ================================================================
//  KIRUVCHI SMS BUYRUG'I — ikki tomonlama boshqaruv (lahzali, ishonchli)
//  Qabul qilinadigan buyruqlar (katta-kichik harf farqsiz):
//    AERATOR ON     -> aeratorni majburan yoqadi
//    AERATOR AUTO   -> avtomatik rejimga qaytaradi (OFF ham shu)
//    MINDO <n>      -> minimal DO (1..20 mg/L)
//    FARQ <n>       -> farq (1..10 mg/L)
//    KRITIK <n>     -> kritik DO / qo'ng'iroq chegarasi (1..20)
//    HOLAT          -> joriy holatni SMS bilan qaytaradi
//  Javoblar saqlangan fermer raqamiga (telRaqam) yuboriladi.
// ================================================================
void smsBuyruqniQolla(const char* matn) {
  char m[64];
  uint8_t i = 0;
  for (; matn[i] && i < sizeof(m) - 1; i++) m[i] = (char)toupper((unsigned char)matn[i]);
  m[i] = '\0';

  char* pos;
  if (strstr(m, "AERATOR ON")) {
    qolReleYoq = true;
    smsNavbatgaQosh("Aerator: QO'LDA YONIQ");
  } else if (strstr(m, "AERATOR AUTO") || strstr(m, "AERATOR OFF")) {
    qolReleYoq = false;
    smsNavbatgaQosh("Aerator: AVTO rejim");
  } else if ((pos = strstr(m, "MINDO")) != NULL) {
    int v = atoi(pos + 5);
    if (v >= 1 && v <= 20) {
      minDo_x10 = (int16_t)(v * 10);
      prefs.putShort("minDo", minDo_x10);
      smsNavbatgaQosh("Min DO o'rnatildi");
    }
  } else if ((pos = strstr(m, "FARQ")) != NULL) {
    int v = atoi(pos + 4);
    if (v >= 1 && v <= 10) {
      farqDo_x10 = (int16_t)(v * 10);
      prefs.putShort("farqDo", farqDo_x10);
      smsNavbatgaQosh("Farq o'rnatildi");
    }
  } else if ((pos = strstr(m, "KRITIK")) != NULL) {
    int v = atoi(pos + 6);
    if (v >= 1 && v <= 20) {
      kritikDo_x10 = (int16_t)(v * 10);
      prefs.putShort("kritikDo", kritikDo_x10);
      alarmFaol = false; alarmTasdiq = false;
      smsNavbatgaQosh("Kritik DO o'rnatildi");
    }
  } else if (strstr(m, "HOLAT")) {
    char r[SMS_MAX_UZUN];
    snprintf(r, sizeof(r), "%s DO=%d.%d pH=%d.%d T=%d.%d Aer:%s",
      deviceId, do_x10 / 10, do_x10 % 10, ph_x10 / 10, ph_x10 % 10,
      t_x10 / 10, t_x10 % 10, releHolati ? "ON" : "OFF");
    smsNavbatgaQosh(r);
  }
  // notanish buyruqqa javob bermaymiz
}

// ================================================================
//  WiFi ORQALI TELEMETRIYA (ESP32 HTTPClient — tez, AT'siz)
//  Qisqa timeout + WDT reset: loop'ni uzoq bloklamaydi.
// ================================================================
bool wifiBilanYubor() {
  if (WiFi.status() != WL_CONNECTED) return false;
  char url[224];
  if (FB_AUTH[0] != '\0')
    snprintf(url, sizeof(url),
      "https://%s/smartlake/devices/%s/telemetry.json?auth=%s", FB_HOST, deviceId, FB_AUTH);
  else
    snprintf(url, sizeof(url),
      "https://%s/smartlake/devices/%s/telemetry.json", FB_HOST, deviceId);

  WiFiClientSecure client;
  client.setInsecure();              // sertifikat tekshiruvisiz (telemetriya uchun yetarli)
  HTTPClient http;
  http.setConnectTimeout(5000);
  http.setTimeout(6000);
  esp_task_wdt_reset();
  if (!http.begin(client, url)) { esp_task_wdt_reset(); return false; }
  http.addHeader("Content-Type", "application/json");
  int code = http.PUT((uint8_t*)telemetriyaBuf, strlen(telemetriyaBuf));  // RTDB: PUT = ustiga yozish
  http.end();
  esp_task_wdt_reset();
  return (code == 200 || code == 201);
}

// ================================================================
//  WiFi SOZLASH PORTALI (111T) — non-blocking, sanoatga mos
//  Qurilma vaqtincha "AquaMonitor-WiFi" nuqtasi bo'ladi; fermer
//  telefonidan ulanib, o'z WiFi'sini tanlab parol kiritadi. Saqlanadi.
//  Portal davomida rele/sensor ishlab turaveradi (faqat LCD band bo'ladi).
// ================================================================
void wifiPortalBoshla() {
  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("WiFi sozlash... ");
  lcd.setCursor(0, 1); lcd.print("Tel:AquaMonitor ");
  wm.setConfigPortalBlocking(false);     // MUHIM: loop'ni bloklamasin
  wm.setConfigPortalTimeout(180);        // 3 daqiqada o'zi yopiladi
  wm.startConfigPortal("AquaMonitor-WiFi");
  wifiPortalAktiv = true;
  wifiPortalBosh  = millis();
}

// ================================================================
//  SETUP
//  [BUG #2 TUZATILDI]: WDT initsializatsiyasi Arduino core 2.x/3.x
//  bilan mos keluvchi usulga o'tkazildi.
//  esp_task_wdt_reconfigure() faqat core 3.x da mavjud.
//  Ikkala versiyada ishlaydigan usul: avval deinit, keyin init.
// ================================================================
void setup() {
  // WDT: 10 soniya timeout — Arduino ESP32 core 2.x va 3.x bilan mos
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  // Core 3.x usuli
  esp_task_wdt_config_t wdt_config = {
    .timeout_ms     = 10000,
    .idle_core_mask = 0,
    .trigger_panic  = true
  };
  esp_task_wdt_reconfigure(&wdt_config);
#else
  // Core 2.x usuli
  esp_task_wdt_init(10, true);   // 10 soniya, panic = true
#endif
  esp_task_wdt_add(NULL);

