smartlake26-rgb/smartlake/firmware/aqua_monitor_esp32.ino
  Serial.begin(115200);

  deviceIdYarat();                       // qurilma ID (chip ID dan, o'zgarmas)
  internetYoqilgan = (FB_HOST[0] != '\0');

  // WiFi: saqlangan parol bilan fonda ulanadi (kutmaymiz — non-blocking)
  WiFi.mode(WIFI_STA);
  WiFi.setSleep(false);
  WiFi.begin();                          // oldin saqlangan tarmoqqa avto-ulanish

  pinMode(RS485_DE,  OUTPUT); digitalWrite(RS485_DE,  LOW);
  pinMode(RELE_PIN,  OUTPUT); digitalWrite(RELE_PIN,  LOW);

  modbusSerial.begin(9600, SERIAL_8N1, MODBUS_RX, MODBUS_TX);
  node.preTransmission(preTransmission);
  node.postTransmission(postTransmission);
  node.begin(1, modbusSerial);

  Wire.begin(21, 22);
  Wire.setClock(100000);   // 100 kHz — uzun kabel/shovqinga chidamliroq
  Wire.setTimeOut(50);     // I2C osilib qolsa 50ms da chiqadi (WDT trip oldini oladi)
  lcd.init();
  lcd.backlight();
  simSignalCharlarYarat();         // antenna + signal panjara belgilarini yuklash
  esp_task_wdt_reset();

  // RTC: bir necha marta urinib ko'ramiz (boot paytidagi vaqtinchalik
  // I2C shovqini tufayli noto'g'ri "yo'q" deb hisoblamaslik uchun)
  bool rtcOk = false;
  for (uint8_t i = 0; i < 5; i++) {
    esp_task_wdt_reset();
    if (rtc.begin()) { rtcOk = true; break; }
    delay(200);
    esp_task_wdt_reset();
  }
  if (!rtcOk) {
    lcd.clear();
    lcd.setCursor(0, 0); lcd.print("RTC topilmadi!  ");
    lcd.setCursor(0, 1); lcd.print("Ulanishni tekshir");
    while (1) { esp_task_wdt_reset(); delay(1000); }
  }
  esp_task_wdt_reset();

  prefsTekshir();
  esp_task_wdt_reset();

  simBoshlash();                   // SIM800L UART/RST/holatlarini ishga tushirish
  esp_task_wdt_reset();

  lcd.clear();
  datchikBoshlanishTekshir();
  esp_task_wdt_reset();

  unsigned long t = millis();

  // Boshlang'ich 1 soat rejimi
  boshlangichRejimda    = true;
  boshlangichBosh       = t;
  tsikilRejim           = TSIKL_ISHLASH;
  oxirgiYozuvKaliti     = 0xFFFF;
  qaysiSensorNavbati    = 1;

  lastMeasureTime       = t;
  lastEkranVaqti        = t;
  lastDoCheckTime       = t;
  lastPhCheckTime       = t;
  releOzgarishVaqti     = t;
  lastUxlashEkranVaqti  = t;
  lastTsikilTekshir     = 0;  // darhol birinchi tekshiruv
  lastTelemetriya       = t;  // birinchi telemetriya TELEMETRY_MS dan keyin
  qolReleYoq            = false;

  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("ID: ");
  lcd.print(deviceId);
  lcd.setCursor(0, 1);
  lcd.print(internetYoqilgan ? "Internet: HA    " : "Internet: SMS   ");
  esp_task_wdt_reset();
  delay(2000);
  esp_task_wdt_reset();

  lcd.clear();
  lcd.setCursor(0, 0); lcd.print("BOSHLANGICH: 1s ");
  lcd.setCursor(0, 1); lcd.print("Doim ishlaydi   ");
  esp_task_wdt_reset();
  delay(1500);
  esp_task_wdt_reset();
  delay(500);
  esp_task_wdt_reset();
  lcd.clear();
  esp_task_wdt_reset();
}

// ================================================================
//  LOOP
// ================================================================
void loop() {
  esp_task_wdt_reset();
  nonBlockTekshir();

  // Tsikl va xotira — RTC asosida 5 soniyada bir yangilanadi
  tsikilniYangilash();

  char key = keypad.getKey();
  if (key && !nonBlockAktiv && !wifiPortalAktiv) klaviaturaBoshqar(key);

  // ---- GSM: har loop'da, hech narsani bloklamasdan ----
  simYangilash();        // SIM holat mashinasi (SMS/qo'ng'iroq/signal)
  alarmQaytaQong();      // 10 daqiqalik qayta qo'ng'iroq (soatiga max 3)
  sensorNosozTekshir();  // DO sensor o'lsa bir marta SMS

  // ---- Telemetriya rejasi: WiFi BIRINCHI, SIM ZAXIRA ----
  // Har TELEMETRY_MS: WiFi ulangan bo'lsa WiFi orqali yuboradi; bo'lmasa
  // SIM800L (GPRS) orqali yuborishni so'raydi. Ikkalasi ham yo'q bo'lsa
  // o'tkazib yuboradi (soatlik tarix baribir NVS'da saqlanadi).
  if (internetYoqilgan && taymerOtdimi(lastTelemetriya, TELEMETRY_MS)) {
    lastTelemetriya = millis();
    telemetriyaTayyorla();
    bool yuborildi = false;
    if (WiFi.status() == WL_CONNECTED) yuborildi = wifiBilanYubor();
    if (!yuborildi && simTayyormi && FB_SIM_RELAY[0] != '\0') simTelemSora = true;
  }

  // ---- WiFi sozlash portali (111T orqali ochiladi) — non-blocking ----
  if (wifiPortalAktiv) {
    wm.process();
    if (WiFi.status() == WL_CONNECTED || taymerOtdimi(wifiPortalBosh, 185000UL)) {
      wm.stopConfigPortal();
      wifiPortalAktiv = false;
      nonBlockXabar(WiFi.status() == WL_CONNECTED ? "WiFi ulandi!    "
                                                  : "WiFi vaqt tugadi", 2000);
    }
  }

  // ---- Uzun T (bo'sh holatda 3s ushlab tursa) -> TEST SMS + qo'ng'iroq ----
  if (tBosildi) {
    if (keypad.isPressed('T')) {
      if (taymerOtdimi(tBoshVaqti, T_UZUN_MS)) {
        tBosildi = false;
        if (telRaqam[0] == '\0') {
          nonBlockXabar("Tel raqam yo'q! ", 2000);
        } else {
          DateTime now = rtc.now();
          char msg[SMS_MAX_UZUN];
          snprintf(msg, sizeof(msg),
            "TEST: Aqua Monitor ishlamoqda %02d:%02d", now.hour(), now.minute());
          smsNavbatgaQosh(msg);
          qongiroqSorov(true);
          nonBlockXabar("TEST yuborildi  ", 2000);
        }
      }
    } else {
      tBosildi = false;   // 3s dan oldin qo'yib yuborildi -> bekor
    }
  }

  // [BUG #3 TUZATILDI]: Sensor qayta urinishda xato bayroqlari ham tozalanadi
  // SENSOR_RETRY_MS = 5 daqiqa (avval 1 soat edi)
  if (!doAktivmi && taymerOtdimi(lastDoCheckTime, SENSOR_RETRY_MS)) {
    lastDoCheckTime = millis();
    doAktivmi = true;
    doXato    = false;  // [BUG #3]: Bu satr qo'shildi
  }
  if (!phAktivmi && taymerOtdimi(lastPhCheckTime, SENSOR_RETRY_MS)) {
    lastPhCheckTime = millis();
    phAktivmi = true;
    phXato    = false;  // [BUG #3]: Bu satr qo'shildi
  }

  if (!isCalibrating && joriyRejimKiritish == ' ' && !nonBlockAktiv) {

    // Sensor o'qish
    if (taymerOtdimi(lastMeasureTime, SENSOR_INTERVAL_MS)) {
      lastMeasureTime = millis();
      if (sensorOqishKerakmi() || aeratsiyaRejimi == REJIM_VAQT) {
        readSensorDataSmart();
        if (aeratsiyaRejimi == REJIM_KISLOROD) alarmniTekshir();
      }
    }

    // Ekran va rele yangilash
    if (taymerOtdimi(lastEkranVaqti, EKRAN_INTERVAL_MS)) {
      lastEkranVaqti = millis();
      ekranniYangilash();
      showClock();
      signalniLCDgaChiz();     // antenna + signal panjarasi (14-15 katak)
      boshqarishRele();
    }

    // Uxlash ekrani
    uxlashEkrani();
  }
}
